import {Text, Title, Span} from './Donation.styled';
import {PayDonation} from './PayDonation';

export const Donations=()=>{
    return(
    <>

    <PayDonation/>
    
        <Title> - Чому важливо жертвувати кошти на православну християнську церкву?</Title>
<Text>
Жертвування коштів на православну християнську церкву є не лише актом доброти та підтримки, а й важливим духовним обов’язком, закладеним у Святому Письмі. Це вираження любові до Бога, ближнього та бажання долучитися до побудови Царства Божого на землі. Церква не тільки допомагає людям у духовному зростанні, але й виконує численні соціальні функції: підтримує бідних, годує голодних, піклується про хворих і дає прихисток тим, хто цього потребує. Жертвуючи кошти на церкву, ми підтримуємо ці благородні справи та слідуємо біблійним заповідям.
 </Text>

<Title>- Біблійне обґрунтування жертвування </Title>
<Text>
Жертва як вираження любові до Бога. У Біблії жертвування є актом вдячності та визнання Божої милості. У книзі Притч сказано: « Вшановуй Господа своєю сумлінною працею і принеси Йому найперше зі своїх плодів праведності, щоб твої комори наповнилися вщерть пшеницею, а твої чавила давали в надмірі вино.» (Приповістей 3:9-10). Цей уривок нагадує нам, що все, що ми маємо, дароване Богом. Коли ми жертвуємо частину свого доходу, ми визнаємо, що Він є джерелом усякого добра в нашому житті.
</Text>

<Title> - Приклад ранньої церкви</Title>
<Text>
У книзі Діянь Апостолів описано, як перші християни приносили свої пожертви, щоб допомагати нужденним і підтримувати громаду: <Span> «А всі, які повірили, були разом і мали все спільне. Вони продавали маєтки та майно і ділилися ним з усіма, хто потребував.»</Span> (Дії 2:44-45). Цей приклад показує, як жертвування служить об’єднанню громади та допомагає підтримувати всіх її членів. Ісус Христос навчав любові до ближнього, яка проявляється через милосердя та допомогу тим, хто цього потребує. У Євангелії від Матвія Христос говорить: <Span> « Бо голодував Я, і ви дали Мені їсти; спраглим був, і ви Мене напоїли; чужинцем був Я, і ви Мене прийняли; не мав одягу, і ви Мене одягнули; хворів, і ви Мене відвідали; у в’язниці був Я, і ви прийшли до Мене!»</Span> (Матвій 25:35-36). 
</Text>

<Title>- Практичне значення жертвувань</Title>
<Text>
Будівництво та підтримка храмів Церква є місцем, де християни збираються для молитви, літургії та духовного зростання. Жертви дозволяють будувати нові храми, реставрувати старі святині та підтримувати їх у належному стані. Завдяки цьому віруючі мають можливість знайти місце для спілкування з Богом. Підтримка соціальних програм Православна церква активно займається благодійністю. За рахунок пожертв створюються їдальні для бідних, дитячі притулки, реабілітаційні центри та інші заклади, які допомагають тим, хто опинився в складних обставинах. Жертвування коштів на церкву дозволяє розширювати ці програми та допомагати більшій кількості людей. Духовна освіта Жертвування допомагає розвивати духовну освіту: видавати православну літературу, організовувати недільні школи, проводити семінари та зустрічі для молоді. Це дозволяє передавати віру наступним поколінням та зміцнювати духовність у суспільстві. Особистий приклад Ісуса Христа Сам Ісус Христос показав приклад жертви, віддавши Своє життя заради спасіння людства. Його любов і милосердя є взірцем для кожного християнина. Жертвуючи на церкву, ми стаємо співучасниками Його місії та проявляємо любов до Бога і ближнього. Жертвування на православну церкву — це не просто фінансова підтримка, це духовна інвестиція в наше спільне майбутнє. Кожна пожертва, незалежно від її розміру, стає частиною великої справи служіння Богові та людям. Як говорить апостол Павло: <Span> «Кожний нехай дає за велінням серця, а не з жалем чи з примусу, адже Бог любить того, хто дає з радістю.»</Span> (2 Коринтян 9:7). Нехай наші серця будуть відкритими до жертви, а наше бажання служити Богові і ближньому знайде відображення в добрих справах. Жертвуйте з вірою, і Бог винагородить вас сторицею!
</Text>

<Title> - Жертвуючи на наш Храм</Title>
<Text>
Пожертви, які прихожани залишають в нашому Храмі, спрямовуються на різні потреби для : <br/>
-	благоустрій території навколо церкви,<br/>
-	оздоблювальні та ремонтні роботи в Храмі, недільній школі, та інших споруд комплексу,<br/>
-	оплата за спожиті комунальні послуги (електроенергія, газ, вивезення сміття, інтернет та інші),<br/>
-	навчання у недільній школі дітей та дорослих,<br/>
-	купівля необхідного церковного начиння, облачення для священика та іншу пошивну продукцію,<br/>
-	Богослужбову літературу.
</Text>
<Text>
Також наша релігійна громада збирає та передає благодійну допомога волонтерам.
</Text>
    </>
    )
}