import {Text} from './Donation.styled';
import {PayDonation} from './PayDonation';

export const Donations=()=>{
    return(
    <>

    <PayDonation/>
    
        <p> -Чому важливо жертвувати кошти на православну християнську церкву?</p>
<Text>
        Жертвування коштів на православну християнську церкву є не лише актом доброти та підтримки, а й важливим духовним обов’язком, 
закладеним у Святому Письмі. Це вираження любові до Бога, ближнього та бажання долучитися до побудови Царства Божого на землі. 
Церква не тільки допомагає людям у духовному зростанні, але й виконує численні соціальні функції: підтримує бідних, годує 
голодних, піклується про хворих і дає прихисток тим, хто цього потребує. Жертвуючи кошти на церкву, ми підтримуємо ці благородні
 справи та слідуємо біблійним заповідям.
 </Text>

<h4>Біблійне обґрунтування жертвування </h4>
<Text>
Жертва як вираження любові до Бога У Біблії жертвування є актом вдячності та визнання Божої милості. У книзі Притч сказано:
"Шануй Господа із маєтку свого та з початків усього врожаю свого, і будуть повні твої клуні достатком, а чавила твої 
переливатимуться новим вином" (Притчі 3:9-10).
Цей уривок нагадує нам, що все, що ми маємо, дароване Богом. Коли ми жертвуємо частину свого доходу, ми визнаємо, що Він є 
джерелом усякого добра в нашому житті.
</Text>
<h4> Приклад ранньої церкви</h4>
<Text>
 У книзі Дій Апостолів описано, як перші християни приносили свої пожертви, щоб допомагати нужденним і 
підтримувати громаду:
"І всі віруючі були вкупі, і мали все спільним. Вони продавали маєтки та добра, і ділили їх між усіма, як кому чого потрібно 
було" (Дії 2:44-45).
Цей приклад показує, як жертвування служить об’єднанню громади та допомагає підтримувати всіх її членів.

Ісус Христос навчав любові до ближнього, яка проявляється через милосердя та допомогу тим, хто цього
 потребує. У Євангелії від Матвія Христос говорить:
"Бо голодував Я, і ви дали Мені їсти; прагнув, і ви напоїли Мене; чужинцем Я був, і ви Мене прийняли; нагий Я був, і ви Мене 
зодягнули; слабував, і ви відвідали Мене; у в'язниці Я був, і ви прийшли до Мене" (Матвій 25:35-36).
Жертвуючи на церкву, ми підтримуємо її соціальну місію, яка включає допомогу нужденним, хворим, самотнім та тим, хто перебуває 
у складних життєвих обставинах.
</Text>
<h4> Практичне значення жертвувань</h4>
<Text>
Будівництво та підтримка храмів Церква є місцем, де християни збираються для молитви, літургії та духовного зростання. Жертви 
дозволяють будувати нові храми, реставрувати старі святині та підтримувати їх у належному стані. Завдяки цьому віруючі мають 
можливість знайти місце для спілкування з Богом.

Підтримка соціальних програм Православна церква активно займається благодійністю. За рахунок пожертв створюються їдальні для 
бідних, дитячі притулки, реабілітаційні центри та інші заклади, які допомагають тим, хто опинився в складних обставинах. 
Жертвування коштів на церкву дозволяє розширювати ці програми та допомагати більшій кількості людей.

Духовна освіта Жертвування допомагає розвивати духовну освіту: видавати православну літературу, організовувати недільні школи, 
проводити семінари та зустрічі для молоді. Це дозволяє передавати віру наступним поколінням та зміцнювати духовність у 
суспільстві.

Особистий приклад Ісуса Христа
Сам Ісус Христос показав приклад жертви, віддавши Своє життя заради спасіння людства. Його любов і милосердя є взірцем для 
кожного християнина. Жертвуючи на церкву, ми стаємо співучасниками Його місії та проявляємо любов до Бога і ближнього.

Жертвування на православну церкву — це не просто фінансова підтримка, це духовна інвестиція в наше спільне майбутнє. Кожна 
пожертва, незалежно від її розміру, стає частиною великої справи служіння Богові та людям. Як говорить апостол Павло:
“Кожен нехай дає, як серце йому призволяє, не в смутку й не з примусу, бо Бог любить того, хто з радістю дає” (2 Коринтян 9:7).
Нехай наші серця будуть відкритими до жертви, а наше бажання служити Богові і ближньому знайде відображення в добрих справах.

Жертвуйте з вірою, і Бог винагородить вас сторицею!</Text>
    </>
    )
}