import {Span, TitlePart, SpanText} from './MorningPrayers.styled';

export const MorningPrayers=()=>{
    return(
        <>
        <Span>Вставши від сну, перш будь-якого діла, стань побожно перед святою іконою і, уявляючи себе перед Всевишнім Богом, поклади на себе тричі знак хреста, промовляючи:</Span>
        <p>В ім’я Отця, і Сина, і Святого Духа. Амінь.</p>
        <Span>Спинившись, заспокой свої почуття, щоб твої думки лишили все земне, тоді сотвори три поклони‚ промовляючи:</Span>
        <p>Боже, будь милостивий до мене гріш­ного‚</p>
        <Span>а потім читай наступні молитви без по­спіху і з увагою.</Span>
        <p>Боже, прости мені всі провини мої перед Тобою.
Господи Ісусе Христе, Сину Божий, молитвами Пречистої Твоєї Матері і всіх святих помилуй нас. Амінь.
Слава Тобі, Боже наш, слава Тобі.</p>
        <TitlePart>Молитва до Святого Духа</TitlePart>
        <p>Царю Небесний, Утішителю, Душе істини, що всюди єси і все наповняєш‚ Скар­бе добра і життя Подателю, прийди і вселися в нас, і очисти нас від усякої скверни, і спаси, Благий, душі наші.</p>
        <TitlePart>Трисвяте</TitlePart>
        <p>Святий Боже, Святий Кріп­кий, Святий Безсмертний, помилуй нас (тричі).</p>
        <TitlePart>Мале славослів’я</TitlePart>
        <p>Слава Отцю, і Сину, і Святому Духові нині, і повсякчас, і на віки віків. Амінь.</p>
        <TitlePart>Молитва до пресвятої Тройці</TitlePart>
        <p>Пресвята Тройце, помилуй нас; Господи, очисти гріхи наші; Владико, прости беззаконня на­ші; Святий, зглянься і зціли немочі наші імені Твого ради.
Господи, помилуй (тричі).
Слава Отцю, і Сину, і Святому Духові нині, і повсякчас, і на віки віків. Амінь.</p>
       <TitlePart>Молитва Господня</TitlePart>
       <p>Отче наш, що єси на небесах, нехай святиться ім’я Твоє; нехай прийде Царство Твоє; нехай буде воля Твоя, як на небі, так і на землі. Хліб наш насущний дай нам сьогодні; і прости нам провини наші, як і ми прощаємо винуватцям нашим; і не введи нас у спокусу, але визволи нас від лукавого.
       Бо Твоє є Царство, і сила, і слава‚ Отця, і Сина, і Святого Ду­­ха, нині, і повсякчас, і на віки віків. Амінь.</p>
       <TitlePart>Тропарі Троїчні</TitlePart>
       <p>Вставши після сну, припадаємо до Тебе, Благий, і Ангельську пісню співаємо Тобі, Всемогутній: Свят, Свят, Свят єси, Боже, молитвами Богородиці помилуй нас.
Слава Отцю, і Сину, і Святому Духові.
Ти, Господи, що від сну підняв мене, просвіти розум і серце і уста мої відкрий, щоб піс­нею прославляти Тебе, Свята Тройце: Свят, Свят, Свят єси‚ Боже, молитвами Богородиці помилуй нас.
І нині, і повсякчас, і на віки віків. Амінь.
Несподівано Суддя прийде, і вчинки кожного виявляться; тому зо страхом взиваймо опівночі: Свят, Свят, Свят єси‚ Бо­же, молитвами Богороди­ці помилуй нас.
Господи, помилуй (12 разів).</p>
       <TitlePart>Молитва св. Макарія до Пресвятої Тройці</TitlePart>
       <p>Вставши після сну, подяку приношу Тобі, Пресвята Тройце, Боже наш, що Ти з великої милости Твоєї і довготерпіння не прогнівався на мене лінивого та грішного і не дав мені загинути з моїми гріхами, але, з властивим Тобі чоловіколюбством, підняв мене від сну, щоб зранку прославляти державу Твою. І нині просвіти мої очі мисленні, відкрий мої уста, щоб навчатися слова Твого, і розуміти запо­віді Твої, і чинити волю Твою, і вихваляти Тебе в сердечному прославленні, і в піснях славити всесвяте ім’я Твоє‚ – Отця, і Сина, і Святого Духа, – нині, і повсякчас, і на віки віків. Амінь.</p>
       <TitlePart>Поклоніння Ісусу Христу</TitlePart>
       <p>Прийдіть, поклонімось Цареві нашому‚ Богу.
Прийдіть, поклонімось і припадімо до Христа, Царя і Бога нашого.
Прийдіть, поклонімось і припадімо до Самого Христа, Царя і Бога нашого.</p>
       <TitlePart>Псалом 50</TitlePart>
       <p>Помилуй мене, Боже, з великої милости Твоєї і з великого милосердя Твого прости провини мої. Особливо омий мене від беззаконня мого і від гріха мого очисти мене. Бо беззаконня моє я знаю, і гріх мій повсякчас переді мною. Проти Тебе Єдиного я згрішив і лукаве перед Тобою вчинив, отже праведний Ти в слові Твоїм і справедливий у присуді Твоїм. Ось бо в беззаконні зачатий я, і в гріхах породила мене мати моя. Бо Ти істину полюбив єси, невідоме й таємне мудрости Твоєї явив Ти мені. Окропи мене ісопом – і очищуся, омий мене – і стану біліший від снігу. Дай мені почути радість і веселість – і зраді­ють кістки мої упокорені. Від­верни лице Твоє від гріхів моїх і прости всі беззаконня мої. Серце чисте створи в мені‚ Боже, і духа праведного віднови в нутрі моєму. Не відкинь мене від лиця Твого і Духа Твого Святого не відніми від мене. Поверни мені радість спасіння Твого і духом могутнім укріпи мене. Навчатиму беззаконників шляхів Твоїх, і нечестиві навернуться до Тебе. Визволи мене від вини кривавої‚ Боже, Боже спасіння мого, і язик мій радісно славитиме правду Твою. Господи, відкрий уста мої, і язик мій спо­вістить хвалу Твою. Бо коли б Ти жертви забажав, приніс би я: всепалення Ти не бажаєш. Жертва Богові – це дух упокорений, серцем скорботним і смиренним Ти не погордуєш.
       Ущаслив, Господи, благово­лінням Твоїм Сион, і хай збудуються стіни Єрусалимські. Тоді буде угодна Тобі жертва правди, приношення і всепалення: тоді покладуть на Жертовник Твій тельців.</p>
       <TitlePart>Символ віри</TitlePart>
       <p>Вірую в Єдиного Бога Отця, Вседержителя, Творця неба і землі, всього видимого і невидимого.
І в Єдиного Господа Ісуса Христа, Сина Божого, Єдинородного, що від Отця народився перше всіх віків. Світло від Світла, Бога Істинного від Бога Істинного, рожденного, несотворенного‚ єдиносущного з Отцем, що через Нього все сталося.
Він для нас, людей, і ради нашого спасіння зійшов з небес, і воплотився від Духа Святого і Марії Діви, і став чоло­віком.
І розп’ятий був за нас при Понтії Пилаті, і страждав, і був похований.
І воскрес на третій день, як було написано.
І вознісся на небо, і сидить праворуч Отця.
І знову прийде у славі судити живих і мертвих, і Царству Його не буде кінця.
І в Духа Святого, Господа Животворчого, що від Отця походить, що Йому з Отцем і Сином однакове поклоніння і однакова слава, що говорив через пророків.
В Єдину, Святу, Соборну і Апостольську Церкву.
Визнаю одно хрещення на відпущення гріхів.
Чекаю воскресіння мертвих.
І життя будучого віку. Амінь.</p>
       <TitlePart>Молитви святого Макарія Великого</TitlePart>
       <p>Боже, очисти мене грішного, бо я ніколи нічого доброго не вчинив перед Тобою, але Ти визволи мене від усього злого, і хай буде в мені воля Твоя, щоб неосудно я відкрив уста мої грішні і славив святе ім’я Твоє, – Отця, і Сина, і Святого Духа‚ – нині, і повсякчас, і на віки віків. Амінь.</p>
       <TitlePart>***</TitlePart>
       <p>Від сну вставши, ранішню приношу Тобі, Спасе, пісню і‚ припадаючи‚ прошу Тебе: не дай мені заснути в гріховній смерті, але пожалій мене, Ти, що добровільно розп’явся; і мене, який лежить у лінощах‚ підніми швидко й спаси мене, в предстоянні і молитві. І по сні нічнім пошли мені світлий і безгріш­ний день, Христе Боже, і спаси мене.</p>
       <TitlePart>***</TitlePart>
       <p>До Тебе, Владико Чоловіколюбче, вставши після сну, вдаю­ся і до праці Твоєї стаю з Твоєї милости, і молюся Тобі: допомагай мені повсякчасно і в усякому ділі, і захисти мене від усього лихого, що є в світі, і від ди­явольської спокуси, і спаси мене, і введи в Царство Твоє вічне, бо Ти мене створив і дбаєш про мене, щоб обдарувати мене всяким добром; на Тебе вся моя надія, і Тебе я щиро славлю нині, і повсякчас, і на віки віків. Амінь.</p>
       <TitlePart>***</TitlePart>
       <p>
       Господи, що з великої милости Твоєї і щедрости Твоєї дав мені, рабу Твоєму‚ минулу ніч перебути без напасти від усьо­го злого і супротивника, Ти Сам, Владико, Створителю всього, сподоби мене при світлі Твоєї істини і з просвітленим серцем творити волю Твою нині, і повсякчас, і на віки віків. Амінь.</p>
       <TitlePart>Молитва св. Василія Великого</TitlePart>
       <p>Господи Вседержителю, Боже Небесних Сил і всякої плоті, що на небі живеш і нас‚ смиренних, доглядаєш, серця й думки ви­пробовуєш і те, що є таємне в людині‚ добре бачиш; Безпочаткове і Вічне Світло, в Якому немає ані тіні зміни або перетворення, Сам‚ Безсмертний Царю‚ прийми молитви наші, які ми в цей час грішними нашими устами творимо, на безліч щедрот Твоїх сподіваючись, і прости нам гріхи наші, чи словом, чи ділом, чи думкою, свідомо чи несвідомо заподіяні, і очисти нас від усякої скверни тіла й духу; і дай, щоб ми в бадьорості серця і тверезості розу­му прожили всю ніч цього життя, очікуючи світлого і явленого дня Єдинородного Си­на Твого, Господа Бога і Спаса нашого, Ісуса Христа, коли Він зі славою прийде, Суддя всіх, відплатити кожному по його ділах. Нехай не в сні, а в бадьорості і щирій праці ми з’явимось готовими і ввійдемо з Ним у Божественне Царство Його слави, де голос невмовкний тих‚ що святкують‚ і невимовна утіха всіх, що бачать неосяжну доброту лиця Твого. Бо Ти є істинне Світло, що освітлює і освячує все, і Тебе славить всяке створіння на віки віків. Амінь.</p>
       <TitlePart>Молитва до Ангела-Охоронителя</TitlePart>
       <p>Святий ангеле, приставлений до моєї грішної душі і до пристрасного мого життя, не покидай мене грішного і не відступи від мене за нестриманість мою. Не попусти злому духові володі­ти мною через пристрасті мого смертного тіла. Зміцни мої немічні сили в боротьбі з гріхами і наставляй мене на спасенну дорогу. О святий ангеле Божий, охоронителю й захиснику моєї нерозкаяної душі і тіла, прости мені все, чим образив я тебе за всі дні життя мого, і коли чим погрішив минулої ночі, захисти мене в нинішній день, і охороняй мене від усякої спокуси диявольської, щоб я ніякими гріхами не гнівив Бога мого, і молися за мене до Господа, щоб Він утвердив мене у страху Своїм і показав мене достойним слугою Своєї безмірної благости. Амінь.</p>
       <TitlePart>Молитва до Пресвятої Богородиці</TitlePart>
       <p>О Пречиста Діво, Богородице, надіє всіх християн, що живуть на землі! Не відвертайся від мене грішного, бо я непохитно надіюся на Твоє милосердя. Погаси в мені полум’я ба­­гатьох пристрастей моїх; запали моє жорстоке серце і мій холодний розум любов’ю до виконання заповідей Сина Твого і Бога нашого.
       Викорени, Пречиста, з мого затьмареного розуму і з мого жорстокого серця безнадійність, недбалість, лінощі та безглуздя і всі темні і брудні думки та наміри. Зціли, Владичице, мої тяж­кі духовні й тілесні рани, не попусти, щоб зло пере­ма­­гало мене, і Твоїми материнськими мо­литвами прихили до мене милість Сина Твого, Господа нашого Ісуса Христа, бо Ти бла­гословенна від усіх родів, і сла­­­ви­ться пречисте ім’я Твоє на віки віків. Амінь.</p>
       <TitlePart>Молитва до святого, ім’я якого носиш</TitlePart>
       <p>Моли Бога за мене, святий угоднику Божий (ім’я святого), бо я щиро до тебе звертаюся, скорого помічника й молитвеника за душу мою.</p>
       <TitlePart>Пісня до Пресвятої Богородиці</TitlePart>
       <p>Богородице Діво‚ радуйся, Благодатна Маріє, Господь з Тобою. Благословенна Ти в жонах‚ і благословен плід утроби Твоєї, бо Ти породила Спаса душ наших.</p>
       <TitlePart>Тропар до Хреста і молитва за Батьківщину</TitlePart>
       <p>Спаси, Господи, людей Твоїх і благослови насліддя Твоє, перемогу побожному народові нашому на супротивників подай і Хрестом Твоїм охороняй нас – оселю Твою.</p>
       <TitlePart>Молитви за живих</TitlePart>
       <p>Пом’яни‚ Господи Ісусе Христе‚ Боже наш‚ милості й щедроти Твої від віку сущі‚ заради яких Ти став людиною і розп’ят­тя і смерть‚ заради спасіння православно в Тебе віруючих‚ перетерпіти зволив єси; і воскрес із мертвих‚ і вознісся на небеса‚ і сидиш праворуч Бога Отця‚ і милостиво споглядаєш на молін­ня тих‚ хто смиренно всім серцем призиває Тебе: прихили вухо Твоє і почуй моє смиренне моління нікчемного раба Твого‚ серед пахощів духовних‚ що приношу Тобі за всіх людей Твоїх. І найперше пом’яни, Господи Ісусе Христе‚ Боже наш, Церкву Твою Святу, Соборну й Апостоль­ську, що чесну Свою Кров за неї пролив єси, і утверди, і зміцни, і пошир, збагати, замири, і непереможною від ворогів пекельних повік збережи; розбрат Церков втихомир, думки поганські вгаси, єресі знищи і скорени, безбожництво ви­губи і на ніщо силою Святого Твого Духа перетвори (по­клін).
Владу нашу миром оточи і від усякого ворога й супротивника охорони. Вклади в серце їм усяку добру і спокійну думку про Церкву Твою Святу і про всіх лю­дей Твоїх, щоб і ми в спокої тихе й безтур­ботне життя провадили в істинній вірі, у всякій побожності та чесності (поклін).
Спаси, Господи, і помилуй Свя­тійших Вселенських Патрі­ар­хів православних, Святій­шого отця нашого (ім’я)‚ Пат­ріарха­ Київського і всієї Ру­си-­Ук­ра­їни‚ преосвященнійших митрополитів, архиєпископів, єписко­пів, пресвітерів, дияконів, весь чернечий чин і ввесь причет церковний, що поставив єси їх пасти Твоє словесне стадо, і молитвами їх помилуй і спаси мене грішного (поклін).
Спаси, Господи, і помилуй отця мого духовного (ім’я) і святими його молитвами прости гріхи мої (поклін).
Спаси, Господи, і помилуй батьків моїх, братів, сестер і рідних моїх, і всіх роди­чів моїх та друзів і даруй їм мир Твій та все добре (поклін).
Спаси, Господи, і помилуй старих і молодих, бідних, сиріт, вдовиць, хворих, засмучених, тих, що в біді, в скорботі, у злиднях, в неволі, у в’язницях, на засланні; особливо ж тих, що за Тебе і віру православну безбож­никами, відступниками та єретиками переслідувані, – пом’яни їх, відвідай, укріпи, заспокой і скоро силою Твоєю полегшення, волю і визво­лен­ня їм подай (поклін).
Спаси, Господи, і помилуй доброчинців наших, що допомагають нам, жаліють і доглядають нас, дають нам милостиню і просять за нас, недостойних, молитися за спасіння і вічних благ Твоїх отримання (поклін).
Спаси, Господи, і помилуй посланих на службу, тих‚ що подорожують‚ отців, братів і сестер наших і всіх православних християн (поклін).
Спаси, Господи, і помилуй тих, кого безумством своїм я спокусив і з правдивої дороги звів, а на погані й негідні діла напровадив їх; Божим Твоїм промислом на істинну путь знову їх настанови (поклін).
Спаси, Господи, і помилуй тих, що ненавидять і кривдять нас і роблять нам напасть; не допусти їх до загибелі через мене грішного (поклін).
Тих, що від православної віри відступили, погибельними єресями засліплені‚ і від Церкви нашої відкололися, – світлом Твого пізнання просвіти й до Святої Твоєї Соборної і Апостольської Церкви знову приєднай (поклін).
Мерзенну безбожну богохульну владу скорени, а правовірну утверди, силу християнську під­неси і милості Твої багаті нам пошли (поклін).</p>
        <TitlePart>Молитва за померлих</TitlePart>
        <p>Пом’яни, Господи, спочилих Святійших Патріархів православних, преос­вященних митрополитів, архиєпископів, єпископів, священичий і чернечий чин, причет церковний, що Тобі послужили, благовірних і повікнезабутніх князів, княгинь і гетьманів наших, вікопомних фундаторів святих храмів й у вічних Твоїх оселях зі святими упокой (поклін).
Пом’яни, Господи, душі спочилих рабів Твоїх, батьків моїх (їх імена) й увесь мій рід і прости їм всі провини вільні й невільні, даруй їм Царство й причастя вічних Твоїх благ і Твого безконечного й блаженного життя насолоду (поклін).
Пом’яни, Господи, і всіх в надії на воскресіння і життя вічне спочилих отців‚ братів і сестер наших, православних християн‚ що тут і повсюди лежать, і зі святими Твоїми, де сяє світло лиця Твого, всели, і нас помилуй, як Благий і Чоловіколюбець. Амінь (поклін).
Подай, Господи, відпущення гріхів усім раніше спочилим ­у ві­­рі й надії на воскресіння, отцям, братам і сестрам на­шим, і створи їм вічную пам’ять (тричі).
Достойно є‚ і це є істина‚ славити Тебе‚ Богородицю‚ Присноблаженну і Пре­непорочну і Матір Бога нашого. Чеснішу від херувимів і незрівнянно славнішу від серафимів‚ що без іс­тлін­ня Бога Слово породила‚ сущу Богородицю‚ Тебе величаємо.
Слава Отцю‚ і Сину‚ і Святому Духові нині‚ і повсякчас‚ і на віки віків. Амінь.</p>
        <p>Господи‚ помилуй (тричі).</p>
        <p>Господи Ісусе Христе, Сину Божий, молитвами Пречистої Твоєї Матері і всіх святих помилуй нас. Амінь.</p>
        <p>Під час Великого посту про­мов­ляємо цю молитву:</p>
        <TitlePart>Молитва святого Єфрема</TitlePart>
        <p>Господи і Владико життя мого‚ дух лінивства‚ безнадій­ности‚ владолюбства й марно­слів’я не дай мені <SpanText> (доземний поклін).</SpanText> 
Дух же доброчесности, смиренномудрости‚ терпіння й любови даруй мені‚ рабу Твоєму <SpanText> (доземний поклін).</SpanText> 
Так‚ Господи Царю‚ даруй мені бачити провини мої і не осуджувати брата мого‚ бо Ти благословен єси на віки віків. Амінь <SpanText> (доземний поклін).</SpanText> </p> 
        <Span>Після цього 12 малих поклонів‚ молячись:</Span>
        <p>Боже‚ будь милостивий до мене грішного.
Боже‚ очисти мої гріхи і помилуй мене.
Без числа нагрішив я‚ Господи‚ прости мені.</p>
        <Span>Після цього всю молитву:</Span>
        <p>“Господи і Владико життя мого...” <SpanText> (доземний поклін).</SpanText> </p>
        <Span>Від Великодня до Вознесіння, замість молитви до Святого Духа “Царю Небесний”, співаємо тропар Пасхи:</Span>
        <p>Хтистос воскрес із мертвих, смертю смерть подолав і тим, що в гробах, життя дарував <SpanText>(тричі).</SpanText></p>
      </>
    )
}