import {Container, Text, Image} from './Mainstyled';

import church2 from '../../images/2.jpg';
import church4 from '../../images/4.jpg';
import church7 from '../../images/7.jpg';
import church20 from '../../images/20.jpg';
import church43 from '../../images/20.jpg';

export function Main(){
    return(
        <>
        <Container>
     
                <Text>
                ХРАМ – це складна рукотворна святиня, яка у земних формах символічно зображує неземне, у видимих – невидиме.
                </Text>

                <Image src={church2} alt='church'/>
                
                <Text> 
                Умовно кожен православний храм поділяється на три основних частини: притвор, середню частину та
                 вівтар. Три частини – символ Триєдиного Бога. Трьохскладова будова храму відома ще з часів Старого
                  Завіту і її дотримуються досі, незалежно від форм та розмірів храму. Вівтар повинен бути орієнтованим 
                  на схід, де сходить сонце, це символізує Божественне Світло, рай.
                </Text>

                <Image src={church4} alt='church'/>
        
                <Text>За формою побудови храми бувають хрестоподібними, що нагадує нам про Хрест Христовий і наше спасіння; 
                    круглими, що не мають ні початку, ні кінця та символізують вічність Церкви. Найдревнішою формою 
                    православного храму є «корабель» – символ ковчега спасіння, а найпоширенішою – хрестово-купольна.
                </Text>    

                <Image src={church7} alt='church'/>

                <Text>
                У вертикальній площині храм являв собою образ видимого світу, верхня частина якого означала Небо, тож храмовий купол, 
                його сферична форма, є символічним втіленням «тверді небесної». Купол увінчується хрестом – головним 
                християнським символом, що символізує перемогу Христа над смертю. Храм з двома куполами символізує Божественну 
                та людську природу Ісуса Христа. Кольори куполів теж мають своє сакральне значення. Золоті куполи символізують 
                Божественну славу, а цибулиноподібна форма куполу символізує полум’я свічки.
                </Text>

                <Image src={church20} alt='church'/>

                <Text>
                В українській мові синонімом слова "купол" виступає "баня".
                </Text>

                <Text>
                Варто відзначити, що все це – не догма, а шанована віками традиція. Будь-який храм – це особливе місце присутності 
                Божої, в ньому ми через богослужіння й Таїнства отримуємо ту животворну божественну благодать, яка дарується 
                нам для зміцнення наших фізичних і духовних сил. Тож дякуймо Господу за можливість вільно відвідувати храми Бож
                 – рукотворні святині, бо це є справжнім чудом у нашому житті, виявом милості Божої до нас.
                </Text>

                <Image src={church43} alt='church'/>

              </Container>
        </>
    )
}