import {Text, TitlePart, SpanText} from './PrayerAllNeeds.styled';

export const PrayerAllNeeds=()=>{
    return(
        <>
        <TitlePart>
        Короткі молитви на всякий випадок
        </TitlePart>
        <Text>
        Слава Богові. <br />
     
 Слава Тобі, Господи, слава Тобі.    <br />    

 Господи, благослови.<br />
  
 Господи, помилуй.<br />
  
 Подай, Господи.<br />
  
 Господи, спаси і охорони.<br />
  
 Господи Ісусе Христе, Сину Божий, помилуй нас. Амінь.<br />
  
 Господи Ісусе Христе, Сину Божий, молитвами Пречистої Твоєї Матері і всіх святих помилуй нас. Амінь.<br />
  
 Боже, будь милостивий до мене гріш­ного.<br />
  
 Пом’яни мене, Господи, коли прийдеш у Царство Твоє.<br />
  
 Пресвята Тройце, Боже наш, слава Тобі.<br />
  
 Уповання моє – Отець, при­ста­новище моє – Син, захист мій – Дух Святий. Тройце Свята, слава Тобі.<br />
  
 Все уповання моє на Тебе покладаю, Мати Божа, збережи мене під покровом Твоїм.<br />
  
 Пресвята Богородице, спаси нас.<br />
  
 Святий <SpanText> (ім’я святого, до якого звертаєшся)</SpanText> і всі святі, моліть Бога за нас.<br />
        </Text>

        <TitlePart>
        Молитва перед початком всякого доброго діла
        </TitlePart>
        <Text>
        Милосердний Боже, Отче і Господи, дай мені жадати всім серцем тільки того, чого потребує від мене Твоя свята воля. У всякому ділі дай мені силу шукати перш за все виконання святих Твоїх заповідей. Настав мене на Твою праведну путь і навчи у всякій справі не сходити з неї. Створи моє життя таким, щоб я міг робити все з волі Твоєї, дай мені силу виконати Твої святі заповіді. На всіх стежках життя мого підтримай мої слабкі сили, оборони від лукавої спокуси і благослови на все добре, чисте і святе, щоб і слова­ми уст моїх і всіми ділами життя мого я прославляв святе ім’я Твоє, Бога Велико­го, для нас‚ людей‚ Милосердного Отця, і Си­на, і Святого Духа‚ нині, і пов­сякчас, і на віки віків. Амінь.
        </Text>

        <TitlePart>
        Молитва після скінчення всякого доброго діла
        </TitlePart>
        <Text>
        Всемогутній Боже, Милосерд­ний Отче! Я знаю, що я негідний приносити мою подяку Тобі. Ти не потребуєш нічого від мене, знаючи мою нікчемність, мою бідність перед Тобою. Але Ти дав мені ласкаво Твою заповідь приносити Тобі славословлення і подяку мого вдячного серця.
Великий Боже, Милосердний Отче! Яку, достойну величности Твоєї, подяку можу скласти Тобі я, бідний і нікчемний гріш­ник? Все ж, віруючи у Твою милість до мене грішного, у Твою всепрощальну любов, я приношу Тобі в ім’я Сина Твого, нашого Спасителя і Визволителя, жертву хвали, жертву славословлення мого відданого Тобі і вдячного серця. Ти благословляєш мене у кожній хвилині життя мого, Ти настановляєш мене на все добре, чисте і святе. Ти підтримуєш мене і ведеш мене по дорозі Твоїй, Ти приводиш мене терпляче до вічного блаженства у Твоїм Небеснім Царстві, прощаючи з любов’ю мої провини.
Нехай же слава, честь і поклоніння Тобі, Богу Вічному, ніколи не замовкнуть у серці моїм, нехай воно славить Тебе, Бога Милосердного, в Тройці Святій Єдиного, Отця, і Сина, і Святого Духа‚ нині, і повсякчас, і на віки віків. Амінь.
        </Text>

        <TitlePart>
        Молитви перед їжею
        </TitlePart>
        <Text>
        Проказавши “Отче наш”, промов:
        </Text>
        <Text>
        Очі всіх на Тебе, Господи, звертаються з надією: Ти даєш по­живу всім своєчасно, про­стяга­єш щедру руку Свою і всіх наповнюєш благоволінням Сво­їм. Амінь.
        </Text>
        <Text>
        Або:
        </Text>
        <Text>
        Господи Ісусе Христе, Сину Божий, Ти благословив страви Своїм ученикам, благослови ж і нам поживу цю, бо і ми в Тебе віруємо, надіємось на Тебе, Тобі молимось і Тебе прославляємо на віки віків. Амінь.
        </Text>

        <TitlePart>
        Молитва після їжі
        </TitlePart>
        <Text>
        Дякуємо Тобі, Христе Боже наш, що Ти наситив нас земними Твоїми дарами, не позбав нас і Небесного Твого Царства‚ але‚ як прийшов Ти‚ Спасе‚ поміж учеників Твоїх і мир дав їм‚ прийди до нас і спаси нас. Амінь.
        </Text>

        <TitlePart>
        Молитва перед навчанням
        </TitlePart>
        <Text>
        Милосердний Господи, пошли нам бла­годать Духа Твого Святого, що подає розум і зміцнює духовні сили наші, щоб ми, уваж­но переймаючи науку, виросли Тобі, Творцеві нашому, на славу, батькам нашим на радість, Церкві й Україні на користь.
        </Text>

        <TitlePart>
        Молитва після навчання
        </TitlePart>
        <Text>
        Дякуємо Тобі, Боже, Творцеві нашому, що Ти сподобив нас ласки Твоєї, щоб розуміти навчання. Благослови наших начальників, батьків та вчителів, що ведуть нас до пізнання добра, і пошли нам розум та силу продовжувати науку нашу. Амінь.
        </Text>

        <TitlePart>
        Молитва на Новий рік
        </TitlePart>
        <Text>
        Господи Боже, всього видимого й невидимого творіння Сотворителю, Ти заснував часи і роки: Сам і нині благослови початок нового року, що ми відлічуємо від Твого втілення заради нашого спасіння. Благослови провести цей рік і багато років після нього в мирі та злагоді з ближ­німи нашими; зміцни й пошир Церкву Православну, що Сам її заснував і спасенною жертвою на хресті освятив. Вітчизну нашу піднеси, охорони і прослав; довгоденство, здоров’я, достаток плодів земних і добре поліття дай нам; мене, грішного раба Твого, всіх рідних і ближніх моїх та всіх православних християн, як правдивий наш верховний Пастир, доглядай, охороняй і на путь спасенну направляй, щоб ми, йдучи нею, після довгочасного й щасливого життя на цьому світі досягли Царства Твого Небесного і удостоїлися вічного блаженства з усіма святими Твоїми. Амінь.
        </Text>

        <TitlePart>
        Молитва на день народження
        </TitlePart>
        <Text>
        Господи Боже, Владико всього світу видимого і невидимого, від Твоєї святої волі залежать усі дні й роки життя мого. Дякую Тобі, Отче Премилосердний, що Ти дозволив мені прожити ще один рік; знаю, що за гріхи мої я не гідний цієї милости, але Ти її даєш мені з не­вимовно­го чоло­віколюбства Твого. Продовжи і ще милості Твої мені грішному, продовжи життя моє в доброчесності, в мирі з усіма рідними і в злагоді з усіма ближніми.
        Подай мені достаток плодів земних і все, що для задоволення потреб моїх необхідне. Найпаче ж очисти совість мою, укріпи мене на дорозі спасіння, щоб я, йдучи нею, після довголітнього життя на цьому світі, перейшовши в життя вічне, удостоївся бути наслідником Царства Твого Небесного. Сам, Господи, благослови цей рік, що його починаю, і всі дні життя мого. Амінь.
        </Text>

        <TitlePart>
        Молитва подружжя, що не має дітей
        </TitlePart>
        <Text>
        Вислухай нас, Милосердний і Всемогутній Боже, щоб за благання наше послана була благодать Твоя. Будь милостивим, Господи, до молитви нашої, згадай закон Твій про примноження роду людського і будь Милостивим Покровителем нашим, щоб за Твоєю допомогою зберігалося Тобою ж установлене. Могутньою силою Твоєю Ти з нічого все створив і поклав по­чат­ки всього, що існує в світі, – створив і чоловіка за образом Своїм і високою тайною освятив союз подружжя як образ тайни єднання Христа з Церквою. Зглянься, Милосердний, на рабів Твоїх цих, союзом подружнім сполучених, коли вони благають допомоги Твоєї, нехай буде на них милість Твоя, нехай будуть плодовитими і побачать сини синів своїх аж до третього й четвертого роду, і до бажаної старості доживуть‚ і ввійдуть у Царство Небесне через Господа нашого Ісуса Христа, Якому належить всяка честь, слава і поклоніння із Святим Духом на віки віків. Амінь.
        </Text>

        <TitlePart>
        Молитовне зітхання жінки-християнки, коли вона сподівається дитини
        </TitlePart>
        <Text>
        О Преславна Мати Божа! Змилуйся наді мною, бідною рабою Твоєю, і прийди мені на допомогу в час моїх недуг і небезпек, з якими народжують дітей всі бідні Євині дочки. Згадай, о благословенна в жонах, з якою радістю й любов’ю Ти поспішала в нагірню сторону відвідати родичку Твою Єлисавету, коли вона сподівалася дитини, і як чудесно позначилося благодатне відвідання Твоє на матері й дитині. З невимовного благосер­дя­ Твого дай і мені, негідній служниці Твоїй, щасливо дочекатися дитини. Даруй мені цю ласку, щоб дитина, яка зараз пе­ре­буває під моїм серцем, прий­шовши до пам’яті, з радістю, подібно до святого немовляти Іоана, поклонялася Божественному Господеві Спасителю, що з любови до нас грішних смирився і Сам був Дитиною. Невимовна ра­дість, якою переповнювалося непорочне серце Твоє при погляді на новонародженого Твого Сина і Господа, нехай усолодить скорботу, що чекає мене серед недуг народження. Життя світу, мій Спаситель, народжений Тобою, нехай врятує мене від смерти в час розродження і нехай прилучить плід утроби моєї до числа обранців Божих. Вислухай, Преславна Царице Небесна, смиренне благання моє і зглянься на мене, бідну грішницю, оком милости Твоєї; не посором моєї надії на Твоє велике милосердя і осіни мене, помічнице християн, зцілителько хворих, Твоїм материнським покровом у час моїх мук і хвороби, щоб сподобилась і я відчути на собі, що Ти – Мати милосердя, і щоб я завжди прославляла Твою ми­лість, яка ніколи не відкидає молитви бідних і визволяє всіх, хто звертається до Тебе в час скорботи й хвороби. Амінь.
        </Text>

        <TitlePart>
        Молитва в час негоди (безперервного дощу)
        </TitlePart>
        <Text>
        Владико, Господи Боже наш. Ти колись виконав молитву люблячого Тебе пророка, ревнителя Твого Іллі і благословив на час спинити дощ. І тепер, Чоловіколюбний Творче і Милостивий Господи, прийми й від нас, смиренних і негідних рабів Твоїх, покірні молитви, що їх приносимо Тобі, і, як щедрий, прости наші провини і з чоловіколюбства Твого вислухай наші благання, пошли ясну погоду людям Твоїм і світло сонячне всім, що потребують і просять милости в Тебе; обрадуй землю і задля нещасних людей Твоїх, дітей, худоби і всього іншого живого творіння, що їх Ти годуєш з милости Твоєї і посилаєш їм їжу в свій час. О Господи Боже наш, виконай благання наше і не осором надії нашої, а помилуй нас з милости Твоєї й пошли нам щедроти Твої, бо наші дні швидко минають, і в стражданнях життя наше вкорочується. Не згуби нас за беззаконня наші, якими ми заслужили Твій гнів і кару, але вчини з нами по Твоїй любові й великій милості Твоїй, бо з душею стурбованою і духом засмученим до Тебе припадаємо і, як раби негідні, ще більшої кари варті, з каяттям жалібно благаємо Тебе: грішили ми, беззаконня чинили і у всьому гріховно поводилися, порушуючи Твої заповіді, а тому все, що Ти посилаєш на нас, посилаєш по справедливості й правді. Але не віддавай нас на знищення до кінця, голод і загибель, і щоб не затопила нас бурхлива вода, – згадай у гніві про ласку і будь милостивим заради щедрот Твоїх, помилуй з милосердя Твого творіння і діло рук Твоїх і від усякого зла скоро визволи. Бо Тобі одному, Боже наш, належать милість і спасіння наше, і Тобі славу возсилаємо, Отцю, і Сину, і Святому Духові‚ нині, й повсякчас, і на віки віків. Амінь.
        </Text>

        <TitlePart>
        Молитва батьків
        </TitlePart>
        <TitlePart>
        за померлу дитину
        </TitlePart>
        <Text>
        Господи Ісусе Христе, Боже наш, Владико життя і смерти, Утішителю скорботних! З засмученим і зворушеним серцем удаюся до Тебе і молюся Тобі: пом’яни, Господи, в Царстві Твоїм померлого раба Твого, дитину (ім’я) і створи йому вічную пам’ять. Ти, Владика життя і смерти, дав мені цю дитину, Твоїй же милосердній і премудрій волі вгодно було і взяти її від мене. Нехай буде благословенне ім’я Твоє, Господи! Благаю Тебе, Суддю неба й землі, з безмежної любови Твоєї до нас грішних прости померлій дитині моїй всі гріхи її невільні, словом, ділом, свідомо і несвідомо вчинені. Прости, Милостивий, і наші батьківські гріхи, щоб не залишалися вони на дітях наших; знаю бо, що багато грішили ми перед Тобою, багато чого не дотримали, не вчинили, як Ти заповідав нам. Коли ж дитина наша, що померла, з нашої чи своєї провини, за життя свого служила більше світові й тілу своєму, а не Тобі, Господу і Богу своєму; коли полюбила вона принади світу цього біль­ше, ніж слово Твоє і заповіді Твої; коли вона, віддавшись насолоді життєвій, а не жалю за грі­хи свої, в нестриманості занедбала поміркованість, піст і молитву, – щиро благаю Тебе, прости, Премилостивий Отче, дитині моїй всі такі провини її, прости й полегши, коли й інше зло вчинила вона в житті цьому.
        Христе Ісусе! Ти воскресив дочку Іаїрову за віру й молитву батька її. Ти зцілив дочку жінки хананеянки за віру й благан­ня матері її. Вислухай же і мою молитву, не погордуй і моїм благанням за дити­ну мою. Прости, Господи, прости всі гріхи її та, простивши і очистивши душу її, визволи з муки вічної та всели її з усіма святими Твоїми, що від віку Тобі догоди­ли, там, де нема ні хвороби, ні печалі, ні зітхання, а життя безконечне, бо нема людини, що жила б і не згрішила. Ти – один без гріха. Коли будеш судити світ, нехай почує дитина моя найсолодший голос Твій: “Прийдіть, благо­словенні Отця Мого, наслідуйте Цар­ство, приготоване нам від створення світу”. Бо Ти – Отець милости й щедрот. Ти – життя й воскресіння, і Тобі славу возсилаємо з Отцем, і Святим Духом нині, й повсякчас, і на віки віків. Амінь.
        </Text>

        <TitlePart>
        Молитва дітей за померлих батьків
        </TitlePart>
        <Text>
        Господи Ісусе Христе, Боже наш! Ти – сиріт охоронитель, скорботних пристановище і тих, що плачуть, утішитель. Звертаюся до Тебе я, осиротілий, зітхаючи й плачучи, і молюсь Тобі: вислухай благання моє і не від­верни лиця Твого від зітхань серця мого і від сліз очей моїх. Молюся Тобі, Милосердний Господи, заспокой скорботу мою з приводу розлуки з батьком моїм (ім’я), що породив і виховав мене (або – з матір’ю чи з батьками моїми (імена їх), що породили і виховали мене), а душу його, як таку, що відій­шла до Тебе з правдивою вірою в Тебе і твердою надією на Твою чоловіколюбність і милість, прийми в Царство Твоє Небесне. Схиляюся перед Твоєю святою волею, що нею взято його від мене, і прошу Тебе, тільки не візьми від нього милости й благосердя Твого. Знаю, Господи, що Ти, Суд­дя світу цього, гріхи й нещастя батьків караєш у дітях, внуках і правнуках аж до третього й четвертого роду; але Ти й милуєш батьків за молитви й доброчесність дітей їх, внуків і правнуків. Зі щирістю серця благаю Тебе, Суддє милостивий, не карай вічною карою померлого‚ незабутнього для мене раба Твого, батька мого (ім’я), але відпусти йому всі провини його вільні й невільні, які він учинив думкою, словом чи ділом, свідомо чи несвідомо, за життя свого тут на землі, і з милосердя і чоловіколюбности Твоєї, молитвами Пречистої Богородиці і всіх святих помилуй його і від вічної муки визволи.
        Милосердний Отче отців і дітей! Дай мені всі дні життя мого, до останнього зітхання мого, не переставати пам’ятати про спочилого батька мого в молитвах моїх і благати Тебе, праведного Суддю, щоб Ти оселив його на місці світлому, на місці прохолоди і на місці спокою, з усіма святими, де немає ніякої хвороби, смутку й зітхання. Милостивий Господи! Прийми нині за раба Твого (ім’я) мою щиру цю молитву і віддай йому на­городою Твоєю за працю й пік­лу­вання у вірі та християн­ській побожності, бо він навчив мене знати Тебе, свого Господа, благоговійно молитися Тобі, на Тебе одного уповати в біді, скорботах та хворобах і дотримувати заповідей Твоїх. За добре піклування його про моє зростання духовне, за теплі молитви, які приносив він за мене Тобі, і за всі дари, які він випросив мені від Тебе, віддай йому Своєю милістю‚ Своїми небесними благами і радостями у вічному Царстві Твоєму. Бо Ти – Бог милости і щедрот та чоловіколюбства. Ти – спокій і радість вірних слуг Твоїх, і Тобі славу возсилаємо з Отцем, і Святим Духом нині, і повсякчас, і на віки віків. Амінь.
        </Text>

        <TitlePart>
        Молитва вдівця за померлу дружину
        </TitlePart>
        <Text>
        Христе Ісусе, Господи і Вседержителю! Зі щирістю серця мого молюся Тобі: упокой, Господи, душу померлої раби Твоєї (ім’я) в Небесному Царстві Твоєму. Владико Вседержителю! Ти благословив по­дружню єд­ність чоловіка і жінки, коли сказав: недобре бути чоловікові самому, створимо йому помічника, подібного до нього. Ти освятив цей союз на образ духовного союзу Христа з Церквою. Вірую, Господи, і визнаю, що Ти благословив з’єднати і мене святим союзом цим з однією зі слуг Твоїх. З Твоєї ж милостивої та премудрої волі взято в мене цю рабу Твою, яку Ти дав мені за помічницю й супутницю життя мого. Схиляюся перед цією волею Твоєю і молюся Тобі від усьо­го серця мого, прийми це благання моє за рабу Твою (ім’я) і прости їй, коли згрішила вона словом, ділом, думкою, свідомо чи несвідомо; коли земне полюбила більше від небесного, коли про одяг та прикрашання тіла свого дбала більше, ніж про просвітлення одягу душі своєї, або коли не дбала про дітей своїх; коли завдала кому жалю словом або вчинком; коли нарікала в серці своїм на ближнього свого або осудила кого чи інше щось подібне вчинила. Все це прости їй, як Милостивий та Чоловіколюбний, бо нема людини, що жила б і не згрішила. Не судися з рабою Твоєю, як з творінням Твоїм, не осуди її за гріхи її на вічні муки, а зглянься й помилуй з великої милости Твоєї. Благаю і прошу Тебе, Господи, дай мені силу в усі дні життя мого не переставати молитися за спочилу рабу Твою і аж до кінця життя мого просити для неї в Тебе, Судді всього світу, прощення провин її. Ти, Боже, поклав на голову її вінець з каменя дорогого, вінчаючи її тут‚ на землі, так увінчай її вічною Твоєю славою в Небесному Царстві Твоєму, з усіма святими, що там торжествують, нехай разом з ними і вона вічно оспівує всесвяте ім’я Твоє з Отцем і Святим Духом. Амінь.
        </Text>

        <TitlePart>
        Молитва вдови за померлого чоловіка
        </TitlePart>
        <Text>
            Христе Ісусе, Господи і Вседержителю! Ти – втіха тих, що плачуть, сиріт і вдів захист. Ти сказав: “поклич Мене в день журби твоєї, і врятую тебе”. В дні журби своєї вдаюся до Тебе і молюся Тобі: не відверни лиця Твого від мене і вислухай благання моє, яке приношу Тобі зі сльозами. Ти, Господи і Владико всього, благозволив одружити мене з одним з рабів Твоїх, щоб нам бути одним тілом і одним духом. Ти дав мені його за чолові­ка й захисника. Твоїй милостивій і премудрій волі вгодно було взяти від мене цього раба Твого і залишити мене одну. Схиляюся перед цією Твоєю волею і до Тебе вдаюся в дні журби моєї: заспокой смуток мій з приводу розлуки з рабом Твоїм, другом моїм. Коли Ти взяв його від мене, не візьми від мене Своєї милости. Як колись прийняв Ти дві лепти вдовиці, так прийми і це благання моє. Пом’яни, Господи, душу спочилого раба Твого (ім’я), прости йому всі провини його, вільні й невільні, чи то думкою, чи словом, чи ділом, свідомі чи несвідомі, але з великої милости Твоєї та безлічі щедрот Твоїх полегши й прости всі гріхи його і осели його з святими Твоїми, де немає ні хвороби, ні печалі, ні зітхання, а життя безконечне. Благаю і прошу Тебе, Господи, дай мені всі дні життя мого не переставати молитися за померлого раба Твого (ім’я) і аж до кінця мого просити в Тебе, Судді всього світу, відпущення всіх гріхів його і вселення його в небесні оселі, що їх Ти наготував тим, що люблять Тебе. Коли ж він і згрішив, але не відступив від Тебе і безсумнівно Отця, і Сина, і Святого Духа православно аж до останнього свого подиху визнавав, тому віру в Тебе замість діл прийми, бо нема чоловіка, що жив би і не згрішив. Ти один без гріха, і правда Твоя – правда вічна. Вірую, Господи, що Ти почуєш благання моє і не відвернеш лиця Твого від мене. Побачивши вдовицю, що тяжко плакала, Ти змилосердився і сина її, коли вже несли ховати, воскресив: так, змилосердившись, за­спокой і мою журбу. Як Ти відчинив двері милосердя Твого для раба Твого Феофіла, що відій­шов до Тебе, і простив йому всі провини його за молитви святої Церкви Твоєї, зважаючи на молитви й милостині дружини його, так і я благаю Тебе, прийми і моє благання за раба Твого (ім’я) і введи його в життя вічне. Ти бо єси уповання наше. Ти Бог милости і спасіння, і Тобі славу возсилаємо з Отцем, і Святим Духом нині, й повсякчас, і на віки віків. Амінь.
        </Text>

        <TitlePart>
        Молитва за всякого померлого
        </TitlePart>
        <Text>
        Пом’яни, Господи, Боже наш, у вірі й надії на життя вічне спочилого раба Твого, брата нашого (ім’я) як Милосердний і Чоловіколюбець, відпускаючи гріхи та згладжуючи неправди, полегши, даруй і прости всі його провини вільні й невільні, визволи його від вічної муки та вогню геєнського і дай йому вічні Твої блага, наготовані для тих, що люблять Тебе. Коли ж і згрішив він, та не відступив від Тебе і безсумнівно в Отця, і Сина, і Святого Духа, Бога, Тебе, в Тройці славимого, вірував і одиницю в Тройці і Тройцю в одиниці православно аж до останнього свого подиху визнавав, будь милостивим до нього і віру в Тебе замість діл прийми і з святими Твоїми, як Щедрий, упокой. Нема бо чоловіка, що жив би і не згрішив. Ти один тільки без усякого гріха, і правда Твоя – правда вічна, і Ти один Бог милости і щедрот і чоловіколюбства‚ і Тобі славу возсилаємо, Отцю, і Сину, і Святому Духові‚ нині, й повсякчас, і на віки віків. Амінь.
        </Text>

        <TitlePart>
        Молитва за недужого
        </TitlePart>
        <Text>
        Лікарю душ і тіл наших, Джерело життя нашого, Христе Ісусе Господи і Спасителю наш! Поглянь милосердним оком Твоїм на цього в тяжкій недузі, прихились до наших слізних благань, перстом милосердя Твого доторкнись до немічного тіла хворого брата нашого, вгаси вогонь тіла його, зменш біль недуги його, поверни здоров’я йому, піднеси його з постелі немочі, продовж дні життя його, щоб на землі він послужив Тобі, ходив по стежках заповітів Твоїх та удостоївся Твого Небесного Царства і разом із святими славив Тебе, Бога Милостивого‚ з Отцем і Духом на віки віків. Амінь.
        </Text>

        <TitlePart>
        Псалом 90
        </TitlePart>
        <TitlePart>
        Хвалебна пісня Давида
        </TitlePart>
        <Text>
        Хто живе під охороною Все­виш­нього, той під покровом Бо­га Небесного оселиться. Каже він до Господа: “Ти пристановище і захист мій, Бог мій, і я уповаю на Тебе”. Він спа­­се тебе від сіті ловця і від пошести згуб­ної. Плечима Своїми Він захистить тебе, і під тінню крил Його ти надійно спочиватимеш. Обороною тобі буде прав­да Його. Не побоїшся страху вночі, ані стрі­ли, що летить удень. Ані пошес­ти, що ходить у тем­ряві, ані напасти духа зла опівдні. Впаде біля тебе тисяча, і де­сять тисяч праворуч тебе, але до тебе не наблизиться. Тільки очима твоїми будеш дивитися і помсту над безза­конними бачити. Бо ти сказав: “Господь – надія моя”, і Всевишнього ти обрав за обо­ронця собі. Отже, не прийде до тебе лихо, і пошесть не наблизиться до осе­лі твоєї. Бо Він ан­гелам Своїм звелить, щоб охороняли тебе на всіх пу­тях твоїх. На руках вони понесуть тебе, щоб нога твоя не спіт­­кнулася об камінь. На гас­пи­да й васи­лиска ти наступатимеш і потопчеш лева й змія. Бо каже Господь: “За те, що він поклав надію на Мене, Я визволю його і захищу його, бо він знає імя Моє. Буде кликати Мене, Я почую його; буду з ним у скорботі, визволю його і прославлю його. Довгим життям обдарую його і дам йому спасіння Моє”.
        </Text>

        <TitlePart>
        Боже великий, єдиний
        </TitlePart>
        <Text>
        Боже великий, єдиний, <br/>
Нам Україну храни,<br/>
Волі і світу промінням<br/>
Ти її осіни.<br/>
Світлом науки і знання<br/>
Нас, дітей, просвіти,<br/>
В чистій любові до краю<br/>
Ти нас, Боже, зрости.<br/>
Молимось, Боже єдиний,<br/>
Нам Україну храни,<br/>
Всі свої ласки, щедроти<br/>
Ти на люд наш зверни.<br/>
Дай йому волю, дай йому долю,<br/>
Дай доброго світу, щастя,<br/>
Дай, Боже, народу<br/>
Многая, многая літа.<br/>
        </Text>


        </>
    )
}