import {TitleChapter, TitleParagraph, Text, List} from './ChristeningMain.styled';

export const ChristeningMain=()=>{
    return(
        <>
           <TitleChapter>ХРЕЩЕННЯ</TitleChapter>
           <Text>
           Найперше таїнство, яке звершується над людиною — це святе Хрещення.
Про його значення Христос Спаситель сказав Нико-димові: «Істинно кажу тобі: хто не народиться від води й Духа, той не може ввійти в Царство Боже. Бо народжене від тіла є (лише) тіло, а народжене від Духа є дух» (їв. З, 5-6).
З цих слів видно, що святе Хрещення є духовне народження (звище від Бога) від води й Духа.
Таїнство святого Хрещення установив Сам Христос Господь. Він Сам хрестився від Івана в Йордані. А після вос-
 
кресіння Свого, посилаючи апостолів на проповідь, сказав: «Ідіть, навчайте всі народи і хрестіть їх в ім`я Отця і Сина і Святого Духа» (Мт. 28, 19).
Таїнство святого Хрещення здійснюється так: того, що хрестять, тричі занурюють у воду з словами:
В ім`я Отця. Амінь. (Перше занурення).
І Сина. Амінь. (Друге занурення).
І Святого Духа. Амінь. (Третє занурення). Це — формула святого Хрещення. Без неї охрещення не здійснюється.
           </Text>
           <TitleParagraph>
           Що означає трикратне занурення в воду?
           </TitleParagraph>
           <Text>
           Занурення в воду означає духовне умирання для життя гріховного і зняття вини первородного гріха Адамового.
           А виринання з води означає духовне відродження від води й Духа в нове християнське життя.
           </Text>
           <TitleParagraph>
           Що потрібно для того, щоб достойно пройняти, таїнство святого Хрещення?
           </TitleParagraph>
           <Text>
           Для тих, що досягли віку 7 років і більше — покаяння і глибока віра. «Покайтеся, — каже апостол, — і нехай хреститься кожний з вас в ім`я Ісуса Христа для охрещення від гріхів, і приймете дар Святого Духа» (Діян. 2, 38).
І Христос Господь те ж говорить: «Хто увірує й охреститься, той спасенний буде» (Мр. 16, 16).
Хрещення дорослих не робиться без підготовки. Спочатку готують людину до святого Хрещення і навчають її віри, молитов, навчають покаятися в гріхах. Це зветься катехизація. А перед самим Хрещенням звершується оголошення хрещеника.
Хрещеник мусить бути вимитий, переодягнений у чисту одежу. До нього ставлять хрещених батьків (кума й куму), які, як духовні батьки, приймуть його від купелі Хрещення і будуть навчати його та керувати ним в доброму християнському житті. Куми самі повинні бути добрими православними християнами. Іновірних або безвірних не можна брати кумами. Пе можна також брати в куми людей порочних та розпутних.
           </Text>
           <TitleParagraph>
           Як звершується таїнство Хрещення?
           </TitleParagraph>
           <Text>
           Ставиться купіль з водою, запалюються свічки. На
 
 аналой кладуть хрест і Євангеліє. Священик в єпитрахилі (іноді в ризі) починає оголошення відповідними молитвами за хрещеника і заклинанням, тобто призиванням імені Божого для прощання від хрещеника всіх підступів диявольських.
 Тоді хрещеник тричі відрікається від сатани, від демонів його й від усіх діл його, тричі ж висловлює приєднання до Христа. Урочисто проголошує свою віру в Христа, як Царя й Бога, і тричі промовляє Символ Віри.
 Коли хрестять малих дітей, то хрестять їх по вірі їхніх батьків та кумів, а все вище наведене за дитину промовляють куми.
 Після того хрещеника помазують святою оливою на знак того, що він прищеплюється до дерева Церкви Христової.
 Далі освячується вода, і хрещеника занурюють, як сказано вище, тричі у воду.
 Людина після виходу з купелі стає очищеною від гріхів, святою. На знак того на новоохрещеного одягається чиста біла одежина, а на шию одягається хрест, на знак того, що новоохрещений є віднині християнин.
 Таїнство святого Хрещення, якщо воно виконано правильно, тобто в ім`я Отця і Сина і Святого Духа, з трьома зануреннями, не може повторюватися над тією ж людиною, бо духовне народження буває раз, як і фізичне (тілесне).
 Для того й говориться у Символі Віри: «Визнаю одне Хрещення на відпущення гріхів».
           </Text>
           <TitleChapter>
           Для Хрещення необхідно мати:
           </TitleChapter>

             <List>
                <li>1. Хрестик, натільний на ланцюжку або мотузочці (з будь-якого матеріалу).</li>
                <li>2. Крижму – спеціальне біле бавовняне полотно.</li>
                <li>3. Ікону Ангела Охоронця</li>
                <li>4. Хрещених батьків – мають бути присутні на обряді (обов'язково хрещені, православні і між собою не одружені).</li>
             </List>

           <TitleChapter>
           МИРОПОМАЗАННЯ
           </TitleChapter>
           <Text>
           Це таїнство, в якому при помазанні частин тіла в ім`я Духа Святого, віруючому подаються дари Святого Духа, що дають зростання в благодаті Божій та укріпляють у житті духовному.
Початок помазання св. єлеєм (оливою) ми бачимо ще в Старому Заповіті, коли Господь повелів Мойсееві помазати Аарона й його синів на священство (Вих. 29, 7). Святим єлеєм помазували царів на царство, наприклад пророків Самуїла, Савла й Давида, після чого на них зійшов Дух Святий.
Сам Господь Ісус Христос не мав потреби вживати помазання. Він як Бог дихнув на апостолів і сказав: «Прийміть Духа Святого» (їв. 20, 22).
Святі апостоли після зшестя на них Духа Святого, покладали на новоохрещених свої руки, і на тих сходив Святий Дух (Діян. 19, 6). Але апостоли вживали і помазання св. єлеєм:
«Ви маєте помазання від Святого і знаєте все... і як те Помазання (тобто Дух Святий, даний через помазання) навчає вас усьому, і як воно є правдиве й необманне, то чого воно навчило вас, в тому й перебувайте» (1 їв. 2, 20, 27), — навчає Іван Богослов. Так і апостол Павло каже:
«Той, що утвердив нас у Христі і помазав нас (Той) єсть Бог. Він і вибрав нас і дав запоруку Духа (Святого) в серця наші» (2 Кор. 1, 21-22).
Тому переємники апостолів — архипастирі, а від них і пастирі Церкви Христової для зведення Святого Духа на новоохрещених стали вживати помазання святим миром.
           </Text>
           <TitleParagraph>
           Кола і як звершується це таїнство?
           </TitleParagraph>
           <Text>
           Таїнство Миропомазання звершується над новоохре-щеним зразу після Хрещення. Його мають право звершувати
 
 як архиєрей, так і священики. Але освячувати миро дозволено тільки архиєреям, як пересмішкам апостольським.
 Святим миром помазують чоло, груди, очі, вуха, ніс, уста, руки, ноги й спину, щоб освятити всі почування і всі діяння нового християнина. На кожне помазання частин тіла промовляється формула Миропомазання: «Печать дару Духа Святого».
 Таїнство Миропомазання не повторюється,
           </Text>

        </>
    )
}