import { SpanText } from 'components/EveningPrayers/EveningPrayers.styled';
import {Span, TitlePart, Title} from './Communion.styled';
import { useState } from 'react';

export const Communion=()=>{
    const [showEveningRules, setShowEveningRules] = useState(false);
    const [showFollowing, setFollowing] =useState(false);
    const [showBefor, setBefor]=useState(false);
    const [showAfter, setShowAfter]=useState(false);

    const handleClickEveningRules=()=>{
        setShowEveningRules(!showEveningRules)
    }

    const handleClickFollowing=()=>{
        setFollowing(!showFollowing)
    }

    const handleClickBefor=()=>{
        setBefor(!showBefor)
    }

    const handleClickAfter=()=>{
        setShowAfter(!showAfter)
    }

    return(
        <>
        <Title onClick={handleClickEveningRules}>Вечірнє правило</Title>
        {showEveningRules&&(
            <>
            <p>Господи Ісусе Христе‚ Сину Божий, молитвами Пречистої Твоєї Матері і всіх святих помилуй нас. Амінь.
Слава Тобі, Боже наш, слава Тобі.
Царю Небесний, Утішителю, Душе істини, що всюди єси і все наповняєш‚ Скарбе добра і життя Подателю, прийди і вселися в нас, і очисти нас від усякої скверни, і спаси, Благий, душі наші.
Святий Боже, Святий Кріпкий, Святий Безсмертний, помилуй нас (тричі).
Слава Отцю, і Сину, і Святому Духові нині, і повсякчас, і на віки віків. Амінь.
Пресвята Тройце, помилуй нас; Господи, очисти гріхи наші; Владико, прости беззаконня наші; Святий, зглянься і зціли немочі наші імені Твого ради.
Господи, помилуй (тричі).
Слава Отцю, і Сину, і Святому Духові нині, і повсякчас, і на віки віків. Амінь.
Отче наш, що єси на небесах, нехай святиться ім’я Твоє; нехай прийде Царство Твоє; нехай буде воля Твоя, як на небі, так і на землі. Хліб наш насущний дай нам сьогодні; і прости нам провини наші, як і ми прощаємо винуватцям нашим; і не введи нас у спокусу, але визволи нас від лукавого.
Бо Твоє є Царство, і сила, і слава‚ Отця, і Сина, і Святого Духа, нині, і повсякчас, і на віки віків. Амінь.
Слава Отцю, і Сину, і Святому Духові нині, і повсякчас, і на віки віків. Амінь.
Господи помилуй (12 разів).
Прийдіть, поклонімось Цареві нашому‚ Богу. Прийдіть, поклонімось і припадімо до Христа, Царя і Бога нашого. Прийдіть, поклонімось і припадімо до Самого Христа, Царя і Бога нашого.</p>
      
       <TitlePart>Псалом 50</TitlePart>
       <p>Помилуй мене, Боже, з великої милости Твоєї і з великого милосердя Твого прости провини мої. Особливо омий мене від беззаконня мого і від гріха мого очисти мене. Бо беззаконня моє я знаю, і гріх мій повсякчас переді мною. Проти Тебе Єдиного я згрішив і лукаве перед Тобою вчинив, отже праведний Ти в слові Твоїм і справедливий у присуді Твоїм. Ось бо в беззаконні зачатий я, і в гріхах породила мене мати моя. Бо Ти істину полюбив єси, невідоме й таємне мудрости Твоєї явив Ти мені. Окропи мене ісопом — і очищуся, омий мене — і стану біліший від снігу. Дай мені почути радість і веселість — і зрадіють кістки мої упокорені. Відверни лице Твоє від гріхів моїх і прости всі беззаконня мої. Серце чисте створи в мені‚ Боже, і духа праведного віднови в нутрі моєму. Не відкинь мене від лиця Твого і Духа Твого Святого не відніми від мене. Поверни мені радість спасіння Твого і духом могутнім укріпи мене. Навчатиму беззаконників шляхів Твоїх, і нечестиві навернуться до Тебе. Визволи мене від вини кривавої‚ Боже, Боже спасіння мого, і язик мій радісно славитиме правду Твою. Господи, відкрий уста мої, і язик мій сповістить хвалу Твою. Бо коли б Ти жертви забажав, приніс би я: всепалення Ти не бажаєш. Жертва Богові — це дух упокорений, серцем скорботним і смиренним Ти не погордуєш.
       Ущаслив, Господи, благоволінням Твоїм Сион, і хай збудуються стіни Єрусалимські. Тоді буде угодна Тобі жертва правди, приношення і всепалення: тоді покладуть на Жертовник Твій тельців.</p>
      
       <TitlePart>Символ віри</TitlePart>
       <p>Вірую в Єдиного Бога Отця, Вседержителя, Творця неба і землі, всього видимого і невидимого.
І в Єдиного Господа Ісуса Христа, Сина Божого, Єдинородного, що від Отця народився перше всіх віків.
Світло від Світла, Бога Істинного від Бога Істинного, рожденного, несотворенного‚ єдиносущного з Отцем, що через Нього все сталося.
Він для нас, людей, і ради нашого спасіння зійшов з небес, і воплотився від Духа Святого і Марії Діви, і став чоловіком.
І розп’ятий був за нас при Понтії Пилаті, і страждав, і був похований.
І воскрес на третій день, як було написано.
І вознісся на небо, і сидить праворуч Отця.
І знову прийде у славі судити живих і мертвих, і Царству Його не буде кінця.
І в Духа Святого, Господа Животворчого, що від Отця походить, що Йому з Отцем і Сином однакове поклоніння і однакова слава, що говорив через пророків.
В Єдину, Святу, Соборну і Апостольську Церкву.
Визнаю одно хрещення на відпущення гріхів.
Чекаю воскресіння мертвих.
І життя будучого віку. Амінь.</p>
        <Span>А далі читають канони:
        До Господа нашого Ісуса Пресолодкого‚ молебний до Пресвятої Богородиці (що його співають під час всяких напастей і душевної скорботи)‚ Ангелові-Охоронителю.</Span>
       
        <TitlePart>Пісня 1 Ірмос‚ глас 2-й</TitlePart>
        <p>У глибині знищила колись фараонове все воїнство потужная сила‚ а втілене Слово всезлобний гріх загладило‚ Препрослав- лений Господь‚ славно бо прославився.
Приспів: Ісусе Найсолодший, спаси мене.
Ісусе Найсолодший Христе‚ Ісусе Довготерпеливий‚ зціли душевні мої рани й усолоди серце моє‚ молюся до Тебе‚ Ісусе Спасе мій Многомилостивий‚ і спасаємий величаю Тебе.
Приспів: Ісусе Найсолодший, спаси мене.
Ісусе Найсолодший Христе‚ відкрий для покаяння мені двері‚ Чоловіколюбний Ісусе‚ й прийми мене‚ що до Тебе припадає в щирому благанні‚ Ісусе Спасе мій‚ гріхів прощення подай мені.
Приспів: Ісусе Найсолодший, спаси мене.
Ісусе Найсолодший Христе‚ Ісусе‚ визволи мене з руки облесливого ворога й зроби мене достойним стояти праворуч у славі Твоїй‚ Ісусе Спасе мій‚ а участи ж стояння ліворуч позбав мене.
Приспів: Пресвятая Богородице‚ спаси нас.
Владичице‚ що породила Ісуса Бога‚ молись за негідних рабів‚ Пречистая‚ щоб мук молитвами Твоїми нам позбавитись‚ Неоскверненна‚ оскверненим нам і славою вічносущою насолодитись.
Приспів: Пресвятая Богородице‚ спаси нас.
Многими опанований напастями‚ до Тебе прибігаю‚ спасіння шукаючи. О, Мати Слова й Діво! Від лиха тяжкого мене спаси.
Приспів: Пресвятая Богородице‚ спаси нас.
Страстей напади гріховні мене турбують‚ зневірою наповнюючи мою душу, заспокой‚ Отроковице‚ тишею Сина Твого й Бога‚ Всенепорочная.
Приспів: Пресвятая Богородице‚ спаси нас.
Тебе‚ що породила Спаса й Бога‚ молю‚ Діво‚ позбави мене лиха; до Тебе бо нині прибігаючи‚ простягаю душу і помисли.
Приспів: Пресвятая Богородице‚ спаси нас.
Недужого тілом і душею відвідання Божого і промислу від Тебе сподоби‚ єдина Богоматір‚ бо Ти є Благою і Родительницею Благого.
Приспів: Господи Ісусе Христе‚ Боже мій‚ помилуй мене.
Сподоби‚ Спасе‚ раба Твого достойно пісню співати й восхвалити безплотного ангела‚ наставника й Охоронителя мого.
Приспів: Святий ангеле Божий‚ Охоронителю мій‚ моли Бога за мене грішного.
Один я в нерозумі й у лінощах нині лежу‚ наставниче мій і Охоронителю‚ не залиш мене на загибель.
Слава: Розум мій направ‚ ангеле‚ молитвою твоєю‚ щоб творити мені повеління Божі‚ щоб одержати від Бога відпущення гріхів‚ і настанови мене ненавидіти гріх‚ молюся тобі.
І нині: Молися‚ Діво‚ за мене‚ раба Твого‚ до Благоподателя разом з моїм Ангелом-Охоронителем‚ і настав мене на виконання заповідей Сина Твого й Творця мого.</p>
        
         <TitlePart>Пісня 3 Ірмос</TitlePart>
         <p>Утвердивши мене на камені віри‚ зміцнив Ти уста мої на ворогів моїх‚ і дух мій звеселився‚ коли заспівав: “Нема святішого за Бога нашого‚ й немає праведнішого за Тебе‚ Господи”.
Приспів: Ісусе Найсолодший‚ спаси мене.
Почуй‚ Чоловіколюбний Ісусе мій‚ раба Твого‚ що благає щиро: позбав мене‚ Ісусе‚ осудження і муки‚ єдиний Довготерпеливий‚ Ісусе Найсолодший‚ Многомилостивий.
Приспів: Ісусе Найсолодший‚ спаси мене.
Підніми‚ Ісусе мій‚ раба Твого‚ що в каятті слізно припадає до Тебе‚ Ісусе мій‚ і позбав мене вогню вічного‚ Ісусе Найсолодший‚ Многомилостивий.
Приспів: Ісусе Найсолодший‚ спаси мене.
Час‚ що дав мені єси‚ Ісусе мій‚ у страстях я прожив‚ і ось тепер‚ Ісусе мій‚ не відкидай мене‚ але воззви‚ молюся‚ і спаси‚ Владико Найсолодший.
Приспів: Пресвятая Богородице‚ спаси нас.
Діво‚ що породила Ісуса мого‚ моли позбавити мене вогню вічного‚ єдина заступнице ображених‚ Богоблагодатна‚ й сподоби мене до життя вічного‚ Всенепорочная.
Приспів: Пресвятая Богородице‚ спаси нас.
Вручаю життя моє для захисту й покрови Тобі‚ Богородительнице Діво‚ Ти ж мене покермуй до пристані Твоєї‚ благ винуватице‚ вірних утвердження‚ єдина всехвальна.
Приспів: Пресвятая Богородице‚ спаси нас.
Молю тебе‚ Діво‚ душевну бентежність і бурю смутку мого розжени: Ти бо Богоневісна‚ Начальника спокою Христа родила єси‚ єдина пречистая.
Приспів: Пресвятая Богородице‚ спаси нас.
Ти породила Благодійника‚ добра Винуватця‚ а тому благодіянь багатства всім нам виточи‚ все бо можеш‚ Богоблаженна‚ яко Сильного в могутності Христа породила єси.
Приспів: Пресвятая Богородице‚ спаси нас.
Поможи мені‚ Діво‚ змученому лютими недугами й хворобливими пристрастями‚ бо знаю Тебе‚ Пренепорочна‚ як невичерпну й незубожну скарбницю зцілень.
Приспів: Святий ангеле Божий‚ Охоронителю мій‚ моли Бога за мене грішного.
Всі мої помисли і душу мою до тебе поклав‚ Охоронителя мого. Ти ж від всякої ворожої напасти мене звільни.
Приспів: Святий ангеле Божий‚ Охоронителю мій‚ моли Бога за мене грішного.
Ворог топче мене і пригнічує‚ повчаючи завжди творити волю свою‚ але ти‚ наставниче мій‚ не залиш мене на загибель.
Слава: Дай мені співати пісню з вдячністю й старанням Богові Творцю й тобі‚ благому Ангелові-Охоронителю: “Визволителю мій‚ вирви мене від ворогів‚ що пригнічують мене”
І нині: Зціли‚ Пречистая‚ з моєї душі многонедужні гнійні рани‚ прожени ворогів‚ що завжди борються зі мною.
Кондак‚ глас 4-й
Явися мені‚ милосердний‚ святий ангеле Господній‚ Охоронителю мій‚ і не відлучайся від мене скверного‚ але просвіти мене світлом недоторкненним і сотвори мене достойним Царства Небесного.
Ікос: Душу мою‚ збезчещену многими спокусами‚ ти‚ святий заступнику‚ невимовної слави небесної сподоби разом співати з ликами безплотних Сил Божих‚ помилуй мене й збережи‚ і помислами добрими душу мою просвіти‚ нехай твоєю славою‚ ангеле мій‚ збагачусь я‚ і скинь зломислячих на мене ворогів‚ і сотвори мене достойним Царства Небесного.
Сідальний‚ глас 1-й
Спасе мій Ісусе‚ що блудного спас‚ Спасе мій Ісусе‚ що блудницю прийняв‚ і мене нині помилуй‚ Ісусе Многомилостивий‚ спаси‚ ущедри‚ о Ісусе Благодійнику‚ і мене‚ як Манасію‚ Благоутробний мій Ісусе‚ бо Ти єдиний Чоловіколюбний.
Слава: Від любови душевної співаю тобі‚ Охоронителю душі моєї: “Всесвятий мій ангеле‚ покрий мене‚ супроводжуй і оберігай від лукавого уловлення завжди й до життя небесного настав‚ врозумляючи‚ просвічуючи й скріплюючи мене”.
І нині: Богородице Безневісная‚ Пречистая‚ що безсіменно породила Владику всіх‚ Його ж із Ангелом-Охоронителем моїм моли позбавитися мені всякого вагання й дати зм’якшення серцю‚ й світло душі моїй‚ і згрішенням очищення‚ Ти бо єдина скорозаступниця.</p>
      
        <TitlePart>Пісня 4 Ірмос</TitlePart>
        <p>Прийшов єси не заступник і не ангел‚ а сам Господь‚ від Діви втілений‚ і спас єси всього мене чоловіка; тому до Тебе взиваю: “Слава силі Твоїй‚ Господи”.
Приспів: Ісусе Найсолодший‚ спаси мене.
Зціли мене‚ Ісусе мій‚ моєї душі рани‚ Ісусе мій‚ молюся: з руки душетлінного ворога вирви мене‚ Ісусе мій Благоутробний‚ і спаси мене.
Приспів: Ісусе Найсолодший‚ спаси мене.
Згрішив я‚ Ісусе мій Найсолодший‚ Благоутробний: Ісусе мій‚ спаси мене‚ що прибігає до Твого покрову‚ Ісусе Довготерпеливий‚ і сподоби мене Твого Царства.
Приспів: Ісусе Найсолодший‚ спаси мене.
Ніхто так не згрішив‚ Ісусе мій‚ як згрішив я окаянний‚ але припадаю‚ молячись: Ісусе мій‚ спаси мене‚ й життя в насліддя Ти мені даруй.
Приспів: Пресвятая Богородице‚ спаси нас.
Всехвальна‚ що породила Ісуса Господа‚ моли ж Його позбавити муки всіх‚ хто оспівує й іменує Тебе істинною Богородицею.
Приспів: Пресвятая Богородице‚ спаси нас.
Бурю прогрішень і страстей моїх збудження втихомир‚ Богоневісная‚ що породила Керманича Господа.
Приспів: Пресвятая Богородице‚ спаси нас.
Милосердя Твого безодню благаю подати мені і для всіх‚ хто співає Тобі‚ тому‚ що Ти Благосердого породила й Спаса всіх.
Приспів: Пресвятая Богородице‚ спаси нас.
Насолоджуючись‚ Пречиста‚ Твоїми дарами‚ прославля- ємо в піснях Тебе як Богоматір.
Приспів: Пресвятая Богородице‚ спаси нас.
Поможи мені‚ безпомічному‚ на одрі хвороби моєї й немочі‚ як Благолюбива‚ єдина Приснодіво.
Приспів: Святий ангеле Божий‚ Охоронителю мій‚ моли Бога за мене грішного.
Молись до Чоловіколюбця Бога‚ Ангеле-Охоронителю мій‚ і не залишай мене‚ але завжди супроводь життя моє в мирі‚ подаючи мені спасіння непоборне.
Приспів: Святий ангеле Божий‚ Охоронителю мій‚ моли Бога за мене грішного.
Як заступника й Охоронителя життя мого прийняв я тебе від Бога‚ ангеле‚ молю тебе‚ святий‚ від усяких бід мене визволити.
Слава: Мою скверність твоєю святинею очисти‚ Охороните- лю мій‚ і від долі ліворучної нехай буду я відлучений твоїми молитвами‚ і слави причасником явлюся.
І нині: Я в ваганні від лиха‚ що мене обступило‚ Пречистая‚ але позбав мене скоро від нього‚ до Тебе бо єдиної я прибігаю.</p>
         
          <TitlePart>Пісня 5 Ірмос</TitlePart>
          <p>Христе Спасе мій‚ Ти просвічення для лежачих у темряві‚ спасіння тим‚ хто у відчаї‚ молюся до Тебе‚ Царю світу: просвіти мене осяянням Твоїм‚ бо іншого Бога крім Тебе не знаю.
Приспів: Ісусе Найсолодший‚ спаси мене.
Ти розуму мого просвічення‚ Ісусе мій‚ Ти душі моєї зневіреної спасіння‚ Спасе‚ позбав мене мук і вогню вічного‚ благаю‚ і спаси‚ Ісусе мій Христе‚ окаянного мене.
Приспів: Ісусе Найсолодший‚ спаси мене.
Всеконечно‚ Ісусе мій‚ до страстей безчестя звержений нині я. Благаю: Ісусе мій‚ пошли мені Твою руку спасіння і вирви мене благаючого: спаси‚ Ісусе мій‚ Христе, мене окаянного.
Приспів: Ісусе Найсолодший‚ спаси мене.
Осквернений розум‚ Ісусе мій‚ обносячи, взиваю до Тебе: очисти мене від скверни прогрішень і вийми мене з глибин зла‚ куди з невідання донизу сповз‚ Спасе Ісусе мій‚ спаси мене‚ молюся.
Приспів: Пресвятая Богородице‚ спаси нас.
Отроковице Богородителько‚ що породила Ісуса‚ ублагай Його спасти всіх православних‚ ченців і мирян від вогню вічного‚ крім Тебе заступництва надійного не знаємо.
Приспів: Пресвятая Богородице‚ спаси нас.
Наповни‚ Чистая‚ веселістю серце моє‚ Твою нетлінну радість даючи‚ через народження Винуватця веселости.
Приспів: Пресвятая Богородице‚ спаси нас.
Визволи нас від бід‚ Богородице Чистая‚ породивши вічне спасіння і мир‚ що перевершує всякий розум.
Приспів: Пресвятая Богородице‚ спаси нас.
Ти‚ що породила Світло Божественне й Превічне‚ розвій морок гріхопадінь моїх‚ Богоневісто‚ просвіченням Твоєї світлости.
Приспів: Пресвятая Богородице‚ спаси нас.
Зціли, Чистая, душі моєї неміч‚ відвіданням Твоїм сподобивши, і здоров’я подай мені молитвами Твоїми.
Приспів: Святий ангеле Божий‚ Охоронителю мій‚ моли Бога за мене грішного.
Перед Богом маючи дерзновення‚ ублагай Його‚ Охоронителю мій святий‚ позбавити мене бід‚ що приносять скорботу.
Приспів: Святий ангеле Божий‚ Охоронителю мій‚ моли Бога за мене грішного.
Світло світле‚ наставнику мій і Охоронителю‚ даний мені від Бога‚ просвіти яскраво душу мою.
Слава: Мене, сплячого в тяжких гріхах‚ збережи як несплячого‚ ангеле Божий‚ піднявши на славослів’я молінням твоїм.
І нині: Маріє‚ Діво Богородице Безневісна‚ вірних надіє‚ ворожі приношення відкинь‚ а тих‚ що Тобі співають‚ – звесели.</p>
       
         <TitlePart>Пісня 6  Ірмос</TitlePart>
         <p>У безодні гріховній потопаючи‚ благаю незбагненну безодню милосердя Твого: від тління‚ Боже‚ мене відведи.
Приспів: Ісусе Найсолодший‚ спаси мене.
Ісусе мій‚ Христе Многомилостивий‚ у сповіді мене прийми‚ Владико‚ о Ісусе‚ і спаси мене‚ і від тління‚ Ісусе‚ мене вирви.
Приспів: Ісусе Найсолодший‚ спаси мене.
Ісусе мій‚ немає іншого такого блудника‚ як я пристрасний‚ о Ісусе Чоловіколюбний‚ але Ти‚ Ісусе‚ мене спаси.
Приспів: Ісусе Найсолодший‚ спаси мене.
Перевершив я‚ Ісусе мій‚ блудницю й блудного‚ Манасію й митаря пристрастями‚ о Ісусе мій‚ і розбійника‚ і ніневитян.
Приспів: Пресвятая Богородице‚ спаси нас.
Ісуса Христа мого породивши‚ Пречистая Діво‚ єдина Неоскверненная‚ оскверненого мене ісопом молитв Твоїх нині очисти.
Приспів: Пресвятая Богородице‚ спаси нас.
Від тління й смерти спас Той‚ хто Сам Себе віддав смерті‚ моє єство‚ що було забране тлінням і смертю‚ тому‚ Діво‚ моли Господа й Сина Твого ворожих підступів мене позбавити.
Приспів: Пресвятая Богородице‚ спаси нас.
Як заступницю життя Тебе знаю й охоронительку тверду‚ Діво‚ таку‚ що від напастей і наговору визволяє і спокусу бісів відганяє‚ і молюся завжди‚ щоб від тлінних пристрастей моїх позбавитися мені.
Приспів: Пресвятая Богородице‚ спаси нас.
Немов стіну захисну придбали‚ і душ вседосконале спасіння‚ і простір серед скорбот‚ Тебе‚ Отроковице‚ і просвіченням Твоїм завжди радіємо‚ о Владичице! І нині нас від пристрастей і бід спаси.
Приспів: Пресвятая Богородице‚ спаси нас.
На одрі нині немічний лежу‚ і немає зцілення плоті моїй‚ але до Тебе Благої‚ що породила Позбавителя недугів Бога і Спаса світу‚ молюся: від тління недугів підніми мене.
Приспів: Святий ангеле Божий‚ Охоронителю мій‚ моли Бога за мене грішного.
Від усяких напастей мене вивільни й спаси від печалей‚ молюся тобі‚ святий ангеле‚ даний мені від Бога‚ Охоронителю мій добрий.
Приспів: Святий ангеле Божий‚ Охоронителю мій‚ моли Бога за мене грішного.
Освіти розум мій‚ блаже‚ й просвіти мене‚ молюся тобі‚ святий ангеле‚ завжди настановлюй і мене думати про корисне.
Слава: Утримай серце моє від бунту‚ дбанням укріплюючи його до благости‚ Охоронителю мій‚ і настав мене чудно до життєвого спокою.
І нині: Слово Боже в Тебе вселилося‚ Богородице‚ показавши Тебе людям‚ як небесну ліствицю‚ якою Вишній зійшов до нас.
Кондак
Непереможний Воєводо і Господи, пекла Переможцю, ми, визволені від вічної смерти, похвальну пісню співаємо Тобі, творіння і раби Твої. А Ти, що маєш безмірне милосердя, визволи від усякої біди нас, що кличемо: Ісусе, Сину Божий, помилуй нас.
Славa; І нині:
Заступнице християн усердная‚ молитвенице до Творця надійная‚ не погордуй молитвами грішників‚ але прийди швидше‚ як Благая‚ на поміч нам‚ що з вірою взиваємо до Тебе: поспіши на молитву й скоро прийди на благання‚ бо Ти заступаєшся завжди за тих‚ що шанують Тебе‚ Богородице.</p>
         
          <TitlePart>Пісня 7  Ірмос</TitlePart>
          <p>Троє Твоїх отроків відкинули безбожні повеління образу золотому на полі Деіри служити; посеред вогню ж ввергнуті‚ окроплені росою співали: благословен єси‚ Боже отців наших.
Приспів: Ісусе Найсолодший‚ спаси мене.
Христе Ісусе‚ ніхто не нагрішив од віку на землі‚ як нагрішив я‚ окаянний і блудний‚ о Ісусе мій. Тому‚ Ісусе мій‚ оспівуючи Тебе‚ взиваю: змилосердься до мене‚ благословенний Боже отців наших.
Приспів: Ісусе Найсолодший‚ спаси мене.
Христе Ісусе‚ до страху Твого пришпили мене‚ взиваю‚ о Ісусе мій‚ і скеруй мене нині до пристані благозатишної‚ Ісусе мій щедрий‚ тому‚ що співаю Тобі‚ спасаємий: благословен єси‚ Боже отців наших.
Приспів: Ісусе Найсолодший‚ спаси мене.
Христе Ісусе‚ безліч разів обіцяв я Тобі‚ пристрасний‚ покаятися‚ о Ісусе мій‚ але обманув‚ окаянний. Тому‚ Ісусе мій‚ взиваю до Тебе: нечутливу душу мою просвіти‚ Христе‚ отців Боже‚ благословен єси.
Приспів: Пресвятая Богородице‚ спаси нас.
Всенепорочна‚ що породила Христа Ісуса дивно‚ надприродно‚ моли ж Його через єство простити мені всі прогрішення мої‚ Отроковице‚ щоб я, спасенний, взивав: благословенна єси Ти, що породила Бога у плоті.
Приспів: Пресвятая Богородице‚ спаси нас.
Бажаючи наше спасіння вчинити‚ Спасе‚ Ти до утроби Дівичої вселився‚ і заступницею світові показав Її: отців наших Боже‚ благословен єси.
Приспів: Пресвятая Богородице‚ спаси нас.
Благоволителя милости‚ Якого Ти родила‚ Мати Чистая‚ ублагай позбавити від прогрішень і душевних скверн всіх‚ що з вірою взивають: отців наших Боже‚ благословен єси.
Приспів: Пресвятая Богородице‚ спаси нас.
Як скарб спасіння, і джерело нетління‚ і стовп утвердження‚ і двері покаяння показав Ти Ту‚ що Тебе породила‚ всім‚ хто кличе: отців наших Боже‚ благословен єси.
Приспів: Пресвятая Богородице‚ спаси нас.
Тілесні слабкості і душевні недуги‚ Богородительнице‚ любов’ю приступаючих до покрову Твого сподоби зцілити‚ Діво‚ що Спаса Христа нам породила.
Приспів: Святий ангеле Божий‚ Охоронителю мій‚ моли Бога за мене грішного.
Бути милостивим до мене Бога ублагай‚ Господній ангеле: тебе бо маю за заступника по всі дні життя мого‚ наставника й Охоронителя‚ від Бога дарованого мені навіки.
Приспів: Святий ангеле Божий‚ Охоронителю мій‚ моли Бога за мене грішного.
Не залиш подорожньої душі моєї окаянної бути вбитою розбійниками‚ святий ангеле‚ бо вона від Бога передана тобі непорочною‚ а настав її на путь покаяння.
Слава: Всю мою душу осоромлену приводжу від лукавих моїх помислів і діл‚ попередь мене‚ наставниче мій‚ зцілення подаючи мені благими помислами‚ щоб ухилятися мені завжди на праві стезі.
І нині: Премудрістю і кріпостю Божественною наповни‚ Іпостасна Премудросте Вишнього‚ ради Богородиці‚ всіх співаючих з вірою: отців наших Боже‚ благословен єси.</p>
       
        <TitlePart>Пісня 8 Ірмос</TitlePart>
        <p>Бога‚ що ввійшов у піч вогненну до отроків юдейських і перетворив полум’я на росу‚ оспівуйте діла Господні‚ і підносьте по всі віки.
Приспів: Ісусе Найсолодший‚ спаси мене.
Тебе‚ Ісусе мій‚ благаю: як і блудницю‚ Ісусе мій‚ позбавив Ти від багатьох згрішень‚ так і мене‚ Ісусе Христе мій‚ визволи‚ і очисти осквернену душу мою‚ Ісусе мій.
Приспів: Ісусе Найсолодший‚ спаси мене.
Схилився я‚ Ісусе‚ до тваринних насолод‚ худобою безсловесною став і скотові насправді‚ о Ісусе мій‚ страсно‚ окаянний‚ уподібнився‚ Спасе‚ тому‚ Ісусе‚ безсловесности мене позбав.
Приспів: Ісусе Найсолодший‚ спаси мене.
Впав я‚ о Ісусе‚ в душетлінні розбійники‚ втратив свій одяг боготканий і лежу нині‚ Ісусе мій‚ ранами уражений: возлий‚ Христе мій‚ на мене єлей і вино.
Приспів: Пресвятая Богородице‚ спаси нас.
Ти‚ що носила Ісуса мого й Бога Христа несказанно‚ Богородице Маріє‚ моли Його завжди‚ щоб від бід спастися рабам Твоїм і співцям Твоїм‚ Неспокушеномужня Діво.
Приспів: Пресвятая Богородице‚ спаси нас.
Не погордуй‚ Діво‚ тими‚ хто потребує від Тебе помочі‚ оспівуючи й превозносячи Тебе повіки.
Приспів: Пресвятая Богородице‚ спаси нас.
Немочі душі моєї й тілесні хвороби зціляєш Ти‚ Діво: тому-то прославлю Тебе‚ Чиста‚ повіки.
Приспів: Пресвятая Богородице‚ спаси нас.
Зцілень багатство виточуєш Ти тим‚ хто з вірою співає Тобі‚ Діво‚ і превозносить невимовне Твоє різдво.
Приспів: Пресвятая Богородице‚ спаси нас.
Напастей Ти прилоги відганяєш і пристрастей нашестя‚ Діво; тому-то оспівуємо Тебе по всі віки.
Приспів: Святий ангеле Божий‚ Охоронителю мій‚ моли Бога за мене грішного.
Від Бога посланий‚ преблагий ангеле‚ утверди життя моє‚ раба твого‚ і не залиш мене повіки.
Приспів: Святий ангеле Божий‚ Охоронителю мій‚ моли Бога за мене грішного.
Тебе‚ ангеле‚ суще благо душі моєї‚ наставника й Охоронителя, преблаженний‚ оспівую повіки.
Слава: Будь мені покровом і заборолом у день іспиту всіх людей‚ коли вогнем випробовуватимуться діла добрі й злі.
І нині: Будь мені помічницею й спокоєм‚ Богородице Приснодіво‚ рабу Твоєму‚ і не залиш мене бути позбавленим Твого владарювання.</p>
       
        <TitlePart>Пісня 9 Ірмос</TitlePart>
        <p>Від Бога Бога Слово‚ Який невимовною мудрістю прийшов оновити Адама‚ що через споживання плоду в тління гріховне впав‚ від Святої Діви невимовно втіленого нас ради‚ вірні єдиномудрено піснями величаймо.
Приспів: Ісусе Найсолодший‚ спаси мене.
Перевершив я‚ Ісусе мій‚ Манасію‚ блудницю‚ блудника й розбійника‚ Щедрий Ісусе‚ в ділах безсоромних і бездумних‚ але Ти‚ Ісусе мій‚ попередивши мене‚ спаси.
Приспів: Ісусе Найсолодший‚ спаси мене.
Від Адама всі згрішили‚ Ісусе мій‚ і перед законом‚ і в законі‚ Ісусе‚ і по законі, я окаянний‚ Ісусе мій‚ і в благодаті переможений пристрастями‚ але Ти‚ Ісусе мій‚ провидінням Твоїм спаси мене.
Приспів: Ісусе Найсолодший‚ спаси мене.
Нехай не буду я відлучений‚ Ісусе мій‚ від невимовної Твоєї слави‚ нехай не отримаю я участи ліворучного стояння‚ Ісусе Найсолодший‚ але Ти мене до десних овець Твоїх причисли‚ Христе Ісусе мій‚ і упокой‚ яко Благоутробний.
Приспів: Пресвятая Богородице‚ спаси нас.
Богородице, єдина Неспокушеномужня Діво Маріє‚ що Ісуса носила в собі‚ Його‚ Чистая‚ умилостив, як Сина Твого й Зиждителя‚ позбавити тих, що прибігають до Тебе, спокус‚ бід і вогню майбутнього.
Приспів: Пресвятая Богородице‚ спаси нас.
Від потоку сліз моїх не відвернися Ти‚ що від усякого лиця всяку сльозу втираєш‚ Діво‚ що Христа породила.
Приспів: Пресвятая Богородице‚ спаси нас.
Радістю моє серце наповни‚ Діво‚ Ти‚ що радости прийняла переповнення‚ гріховну печаль знищуючи.
Приспів: Пресвятая Богородице‚ спаси нас.
Пристановищем і заступництвом будь тим‚ хто до Тебе прибігає‚ Діво‚ стіною непорушною‚ прибіжищем‚ покровою і радістю.
Приспів: Пресвятая Богородице‚ спаси нас.
Світла Твого промінням просвіти‚ Діво‚ морок незнання відганяючи‚ благовірно сповідуючих Тебе, Богородицю.
Приспів: Пресвятая Богородице‚ спаси нас.
На місці озлоблення від немочі‚ упокореного мене‚ Діво‚ зціли‚ нездоров’я у здоров’я перетворюючи.
Приспів: Святий ангеле Божий‚ Охоронителю мій‚ моли Бога за мене грішного.
Помилуй мене‚ єдиний Спасе мій‚ яко Милостивий і Милосердний‚ і праведних ликів сотвори мене причасником.
Приспів: Святий ангеле Божий‚ Охоронителю мій‚ моли Бога за мене грішного.
Даруй мені мислити і завжди чинити‚ Господній ангеле‚ добре і корисне‚ і як сильного яви мене в немочі й непорочного.
Слава: Маючи дерзновення до Царя Небесного‚ Його ж моли з іншими безплотними помилувати мене окаянного.
І нині: Багато сміливости маючи до Втіленого із Тебе‚ Діво‚ розв’яжи мене від уз і подай мені визволення і спасіння молитвами Твоїми.</p>
        
        <TitlePart>Молитва до Господа нашого Ісуса Христа</TitlePart>
        <p>Владико Господи Ісусе‚ Боже мій‚ що ради невимовного Свого чоловіколюбства на кінець віків у плоть зодягнувся від Приснодіви Марії, славлю Твій спасенний промисел за мене‚ раба Твого‚ Владико; піснесловлю Тебе‚ бо через Тебе я Отця пізнав; благословляю Тебе‚ бо через Нього й Дух Святий у світ прийшов; поклоняюся Твоїй по плоті Пречистій Матері‚ що послужила такій страшній тайні; величаю Твої ангельські ликостояння‚ як оспівувачів і служителів Твоєї величности; ублажаю Предтечу Іоана‚ що Тебе хрестив‚ Господи; шаную й пророків, що провозвістили про Тебе‚ прославляю апостолів Твоїх святих‚ вшановую і мучеників‚ священиків же Твоїх славлю; поклоняюся преподобним Твоїм і всіх Твоїх праведників вшановую. Таку велику невимовну безліч лику Божественного приводжу Тобі‚ Всещедрому Богові‚ раб Твій‚ і прошу моїх згрішень прощення дарувати мені ради всіх Твоїх святих, а особливо заради святих Твоїх щедрот‚ бо Ти благословен єси повіки. Амінь.</p>
        
        <TitlePart>Молитва до Пресвятої Богородиці</TitlePart>
        <p>Царице моя Преблагая‚ надіє моя Богородице‚ заступнице сиріт і подорожніх пристановище‚ скорботних радосте‚ ображених покровительнице‚ бачачи мою біду‚ бачачи мою скорботу‚ поможи мені‚ як немічному‚ покермуй мною як подорожнім‚ образу мою знаючи – розріши її‚ як бажаєш. Бо не маю іншої помочі окрім Тебе‚ ані іншої заступниці‚ ані благої утішительниці‚ лише Тебе‚ о Богоматір‚ що збереже й покриє мене по віки віків. Амінь.</p>
        
        <TitlePart>Молитва до Ангела-Охоронителя</TitlePart>
        <p>О святий Ангеле-Охоронителю‚ покровителю мій благий! Із сокрушенним серцем і болісною душею стою перед тобою в молитві: почуй мене‚ грішного раба свого (ім’я)‚ із сильним воланням і плачем гірким співаю я: не пом’яни моїх беззаконь і неправд‚ що ними я, окаянний, прогнівляю тебе по всі дні й години‚ і мерзенним себе роблю перед Творцем нашим Господом, явися мені милосердним і не покидай мене скверного до самої кончини моєї; пробуди мене від сну гріховного й допоможи твоїми молитвами весь інший час життя мого без пороку перейти й сотворити плоди‚ достойні покаяння‚ найпаче ж від смертних падінь гріховних убережи мене‚ нехай не загину я у відчаї‚ і нехай не радіє ворог з погибелі моєї. Знаю воістину й устами сповідую‚ що немає іншого такого друга й заступника‚ захисника й поборника‚ як ти‚ святий ангеле‚ бо ти предстоїш перед Престолом Господнім і молишся за мене‚ негідного й найгрішнішого за всіх‚ нехай не відніме Преблагий душі моєї в день моєї безпечности й у день творення гріха. Не переставай далі умилостивлювати Премилосердного Господа й Бога мого‚ нехай відпустить згрішення мої‚ вчинені в житті моїм‚ ділом‚ словом і всіма моїми почуттями, і Своїм провидінням нехай спасе мене‚ нехай покарає мене тут з Своєї невимовної милости‚ але нехай не викриє і не випробує мене Своїм справедливим правосуддям‚ нехай сподобить мене принести покаяння‚ а з покаянням Божественне Причастя достойно прийняти‚ про це найбільше молю й такого дару від усього серця бажаю. У страшний же час смерти невідступно будь зі мною‚ благий Охоронителю мій‚ проганяючи демонів‚ що мають застрашити трепетну душу мою: захисти мене від їхнього ловлення‚ коли проходитиму повітряні митарства‚ нехай‚ захищений тобою‚ безперешкодно досягну раю‚ мною омріяного‚ де лики святих і Горні Сили безперестанно прославляють всечесне й славне ім’я в Тройці славимого Бога - Отця‚ і Сина‚ і Святого Духа. Йому ж належить честь і поклоніння на віки віків. Амінь.</p>
        <Span>Після цього читаємо: “Достойно є” (поклін)‚ “Трисвяте”‚ й по “Отче наш”: Помилуй нас‚ Господи‚ помилуй нас, і далі молитви вечірні.</Span>
            </>
        )}

        <Title onClick={handleClickFollowing}>Послідування до святого Причастя</Title>
        {showFollowing&&(
            <>
              <p>Молитвами святих отців наших, Господи Ісусе Христе‚ Боже наш, помилуй нас. Амінь.
              Слава Тобі, Боже наш, слава Тобі, “Царю небесний” “Святий Боже”, “Пресвята Тройце”, “Отче наш”, Господи, помилуй <SpanText>(12 разів),</SpanText> “Слава: і нині” <SpanText>(тричі),</SpanText> “Прийдіть, поклонімось...” <SpanText>(тричі).</SpanText> </p>
              
              <TitlePart>Псалом 22 Псалом Давида</TitlePart>
              <p> Господь пасе мене, і нічого мені не бракуватиме. На місці плодючім, там Він оселив мене; біля води спокійної виховав мене. Душу мою навернув, навів мене на стежки правди задля імені Свого. Коли піду навіть у тіні смертній, не боятимуся зла, бо Ти зі мною; жезл Твій і палиця Твоя – вони потішили мене. Ти наготував переді мною стіл на очах гнобителів моїх; Ти намастив оливою голову мою, і чаша Твоя, що напоює, найкраща. І милість Твоя буде йти слідом за мною по всі дні життя мого, й оселюся в домі Господнім на довгії дні.</p>
              
              <TitlePart>Псалом 23 Псалом Давида</TitlePart>
              <p>Господня земля і повнота її, вселенна і всі, що живуть у ній. Він на морях заснував її й на ріках утвердив її. Хто зійде на гору Господню, або хто стане на місці святому Його? Невинний руками і чистий серцем; хто не віддав для суєти душу свою і не присягався зрадливо ближньому своєму. Цей прийме благословення від Господа і милостиню від Бога, Спаса свого. Це рід тих, що шукають Його, шукають лиця Бога Якова. Піднесіте, князі, брами ваші, і піднесітеся‚ входи вічні, і ввійде Цар слави. Хто є цей Цар слави? Господь кріпкий і сильний, Господь сильний в бою. Піднесіте, князі, брами ваші, і піднесітеся‚ входи вічні, і ввійде Цар слави. Хто є цей Цар слави? Господь Сил, Він є Цар слави.</p>
              
              <TitlePart>Псалом 115</TitlePart>
              <p>Вірував я, тому й заговорив‚ і я смирився вельми. І сказав я в нестямі моїй: “Кожна людина говорить неправду!” Що віддам Господеві за все, що Він воздав мені? Чашу спасіння прийму й ім’я Господнє призву. Молитви мої Господеві воздам перед усіма людьми Його. Чесна перед Господом смерть преподобних Його. О Господи, я раб Твій, я раб Твій і син рабині Твоєї. Ти розірвав кайдани мої. Тобі принесу жертву хвали й ім’я Господнє призву. Молитви мої Господеві воздам перед усіма людьми Його. У дворах дому Господнього, посеред тебе, Єрусалиме.
              Слава: І нині: Алилуя, алилуя, алилуя. Слава Тобі, Боже <SpanText>(тричі).</SpanText> Три поклони.</p>
              
              <TitlePart>Тропарі, глас 8-й</TitlePart>
              <p>Господи, що від Діви народився, не зважай на беззаконня мої і серце моє очисти, творячи мене храмом Пречистого Твого Тіла й Крови, маючи незчисленні великі милості, не відкидай мене від лиця Твого.</p>
              <Span>Слава:</Span>
              <p>Як наважуся до Причастя Святинь Твоїх приступити я‚ недостойний? Може б‚ насмілитися до Тебе приступити з достойними, але одяг мій викриває мене, бо він не до вечері, і душа моя многогрішна осудження заслужила. Господи, очисти ж скверну душі моєї і спаси мене, бо Ти Чоловіколюбний.</p>
              <Span>І нині:</Span>
              <p>Маючи велике множество гріхів, вчинених мною, до Тебе прибігаю, Богородице Чистая, спасіння благаючи: відвідай немічну душу мою, і моли Сина Твого й Бога нашого дати відпущення моїх гріхів, єдина благословенна.</p>
              
              <TitlePart>Під час Великого посту:</TitlePart>
              <p>Коли славні ученики умиванням ніг на вечері просвіщалися, тоді Юда злочестивий недугою грошолюбства засліплювався і беззаконним суддям Тебе, Праведного Суддю, продавав. Глянь, скарбів ревнителю, на того, що через них повісився. Тікай від тієї ненаситної душі, що на Вчителя так наважилася. Милосердний до всіх Господи, слава Тобі.</p>
              <Span>І псалом 50.</Span>
              <TitlePart>Канон на глас 2</TitlePart>
              <TitlePart>Пісня 1</TitlePart>
              <Span>Ірмос</Span>
              <p>Грядіть, люди, співаємо пісню Христу Богові, що розділив море і наставив людей, звільнивши їх від рабства єгипетського, бо Він прославився.</p>
              <p><SpanText>Приспів:</SpanText> Серце чисте створи в мені‚ Боже, і духа праведного віднови в нутрі моєму. Хлібом, що подає вічне життя і що зціляє від багатьох різноманітних недугів, нехай буде мені, Милосердний Господи, Тіло Твоє і Дорогоцінна Кров Твоя.</p>
              <p><SpanText>Приспів:</SpanText> Не відкинь мене від лиця Твого і Духа Твого Святого не відніми від мене.
               Осквернений непристойними ділами, я, окаянний, недостойний причащення Твого Пречистого Тіла та Божественної Крови, Христе, але сподоби мене його.</p>
             <p><SpanText>Приспів:</SpanText> Пресвята Богородице, спаси нас. Благословенна Богоневісто, земле плодовита, що зростила неораний та спасенний для світу Колос. Сподоби мене спастись, приймаючи Його в їжу.</p>
             
             <TitlePart>Пісня 3</TitlePart>
             <Span>Ірмос</Span>
             <p>Утвердивши мене на камені віри, зміцнив Ти уста мої на ворогів моїх, і дух мій звеселився, коли заспівав: “Нема святішого за Бога нашого, й немає праведнішого за Тебе, Господи”.</p>
             <p><SpanText>Приспів:</SpanText>Серце чисте створи в мені‚ Боже, і духа праведного віднови в нутрі моєму.
             Дай мені, Христе, краплі сліз, що очищають нечистоту мого серця, щоб благою совістю очищений з вірою і страхом приступив я до причащення Божественних Дарів Твоїх, Владико.</p>
             <p><SpanText>Приспів:</SpanText>Не відкинь мене від лиця Твого і Духа Твого Святого не відніми від мене.
             Чоловіколюбче, нехай буде для мене Пречисте Тіло Твоє і Божественна Кров на прощення провин, на спілкування з Святим Духом, на життя вічне, Чоловіколюбче, та на звільнення від страждань і скорбот.</p>
             <p><SpanText>Приспів:</SpanText>Пресвята Богородице, спаси нас.
             Пресвята Трапезо Хліба життя, що з милосердя з неба зійшов і світові нове життя подав, сподоби й мене, недостойного, зі страхом спожити Його та бути живим.</p>
             
             <TitlePart>Пісня 4</TitlePart>
             <Span>Ірмос</Span>
             <p>Прийшов єси не заступник і не ангел, а Господь, від Діви втілений, і спас єси всього мене чоловіка; тому до Тебе взиваю: “Слава силі Твоїй, Господи”.</p>
             <p><SpanText>Приспів:</SpanText>Серце чисте створи в мені‚ Боже, і духа праведного віднови в нутрі моєму.
             Заради нас втілившись, Многомилостивий, Ти захотів бути заколеним, як вівця‚ за гріхи людські. Тому я молю Тебе: очисти і мої провини.</p>
             <p><SpanText>Приспів:</SpanText> Не відкинь мене від лиця Твого і Духа Твого Святого не відніми від мене.
             Зціли рани моєї душі, Господи, і всього освяти, і сподоби, Владико, мене окаянного причаститись Тайної Твоєї Божественної Вечері.</p>
             <p><SpanText>Приспів:</SpanText>Пресвята Богородице, спаси нас.
             Умилостив і до мене Народженого Тобою, Владичице, і збережи мене, раба Твого, чистим та безпорочним, щоб мені освятитися, приймаючи духовний бісер.</p>

             <TitlePart>Пісня 5</TitlePart>
             <Span>Ірмос</Span>
             <p>Світла Подателю і віків Творче, Господи, у світлі заповідей Твоїх настав нас, бо крім Тебе іншого не знаємо.</p>
             <p><SpanText>Приспів:</SpanText> Серце чисте створи в мені‚ Боже, і духа праведного віднови в нутрі моєму.
             Як Ти сказав, Христе, так нехай буде і для мене, вбогого Твого раба, перебувай у мені, як Ти обіцяв, бо ось я споживаю Твоє Божественне Тіло і п’ю Кров Твою.</p>
             <p><SpanText>Приспів:</SpanText> Не відкинь мене від лиця Твого і Духа Твого Святого не відніми від мене.
             Слово Боже і Боже, палаюча вуглина Твого Тіла нехай буде для мене, затьмареного‚ на просвіту і Кров Твоя на очищення оскверненої моєї душі.</p>
             <p> <SpanText>Приспів:</SpanText> Пресвята Богородице, спаси нас.Маріє, Мати Божа, священний храм пахощів, Твоїми молитвами вчини мене вибраною посудиною, щоб мені причаститися святинь Сина Твого.</p>

             <TitlePart>Пісня 6</TitlePart>
             <Span>Ірмос</Span>
             <p>У безодні гріховній потопаючи, благаю незбагненну безодню милосердя Твого: від тління, Боже, мене відведи.</p>
             <p><SpanText>Приспів:</SpanText> Серце чисте створи в мені‚ Боже, і духа праведного віднови в нутрі моєму.
             Розум, душу і серце, а також і тіло моє освяти, Спасе, і сподоби, Владико, приступити до страшних Тайн неосудно.</p>
             <p><SpanText>Приспів:</SpanText>Не відкинь мене від лиця Твого і Духа Твого Святого не відніми від мене.
             Нехай звільнюсь я від пристрастей та нехай дістану примноження благодаті Твоєї та зміцнення життя через причащення святих Твоїх Тайн, Христе.</p>
             <p><SpanText>Приспів:</SpanText>Пресвята Богородице, спаси нас.
             Боже, Слово Боже, Святе, освяти всього мене, що приступаю нині до Божественних Твоїх Тайн по молитвах Твоєї Святої Матері.</p>
             <Span>Кондак</Span>
             <p>Не позбав мене, Христе, можливости прийняти нині Хліб – Тіло Твоє і Божественну Кров, нехай не буде для мене, окаянного, в осуд причащення пречистих і страшних Твоїх Тайн, Владико, але нехай буде для мене на життя вічне та безсмертне.</p>

             <TitlePart>Пісня 7</TitlePart>
             <Span>Ірмос</Span>
             <p>Тілу золотому премудрі діти не послужили, а у вогонь самі ввійшли і богів їхніх осміяли; посеред полум’я співали, зрошені ангелом. Почута вже вуст ваших молитва.</p>
             <p><SpanText>Приспів:</SpanText>Серце чисте створи в мені‚ Боже, і духа праведного віднови в нутрі моєму.
             Причащення Твоїх безсмертних Тайн, Христе, нехай буде для мене нині джерелом благ: світла, життя, душевного спокою, засобом для досягнення доброчесности Божественним клопотанням та примноження її, щоб я прославляв Тебе, Єдиний Благий.</p>
             <p><SpanText>Приспів:</SpanText>Не відкинь мене від лиця Твого і Духа Твого Святого не відніми від мене.
             Приступаючи нині з трепетом, любов’ю та благоговінням до Твоїх безсмертних Таїн, нехай звільнюсь я, Чоловіколюбче, від пристрастей, ворогів та злиднів, від бід та всякої скорботи, і удостой мене співати Тобі: “Благословен єси, Господи, Боже отців наших”.</p>
             <p><SpanText>Приспів:</SpanText>Пресвята Богородице, спаси нас.
             Спасителя Христа Недосяжного для розуму народила, Богоблагодатна, молю Тебе нині, раб Твій‚ Чисту, нечистий: мене, що готуюся тепер приступити до пречистих Тайн, очисти від скверни плоті та духу.</p>

             <TitlePart>Пісня 8</TitlePart>
             <Span>Ірмос</Span>
             <p>Бога, що увійшов у піч вогненну до отроків юдейських і перетворив полум’я на росу, оспівуйте діла Господні і підносьте по всі віки.</p>
             <p><SpanText>Приспів:</SpanText>Серце чисте створи в мені‚ Боже, і духа праведного віднови в нутрі моєму.
             Удостой, Христе, нині і мене, що втратив надію, стати учасником небесних страшних і святих Твоїх Тайн і Твоєї Божественної Тайної Вечері, Боже, Спасе мій.</p>
             <p><SpanText>Приспів:</SpanText>Не відкинь мене від лиця Твого і Духа Твого Святого не відніми від мене.
             Прибігши під Твоє Милосердя, Блаже, я зі страхом благаю Тебе: перебувай у мені, Спасе, і я в Тобі перебуваю, як Ти сказав, бо ось, покладаючи надію на Твою милість, я споживаю Тіло Твоє і п’ю Кров Твою.</p>
             <p><SpanText>Приспів:</SpanText>Пресвята Тройце, слава Тобі.
             Я тремчу, приймаючи вогонь, щоб не згоріти, як віск і як трава. О страшна тайно! О милосердя Боже! Я, як персть земна, причащаюсь Божественним Тілом і Кров’ю і стаю безсмертним.</p>

             <TitlePart>Пісня 9</TitlePart>
             <Span>Ірмос</Span>
             <p>Безпочаткового Отця Син, Бог і Господь, що від Діви, явився нам, щоб просвітити затьмарених і зібрати розсіяних. Тому ми всіма оспівану Богородицю величаємо.</p>
             <p><SpanText>Приспів:</SpanText>Серце чисте створи в мені‚ Боже, і духа праведного віднови в нутрі моєму.
             Причащенням святих Тайн нехай освячусь я, Владико, душею і тілом, нехай просвічусь, нехай спасусь, нехай стану домом Твоїм, маючи Тебе, що живеш в мені з Отцем і Духом, Благодійнику Многомилостивий.</p>
             <p><SpanText>Приспів:</SpanText>Не відкинь мене від лиця Твого і Духа Твого Святого не відніми від мене.
             Як вогонь нехай буде для мене і як світло Тіло Твоє й Кров Найдорогоцінніша, Спасе мій, що опалює гріховну речовину і спалює пристрастей терня, й усього мене просвічує поклонятися Твоєму Божеству.</p>
             <p><SpanText>Приспів:</SpanText>Пресвята Богородице, спаси нас.
             Бог воплотився від чистої Твоєї крови. Тому всі народи оспівують Тебе, Владичице, і сонми духів славлять, що через Тебе вони ясно побачили Владику вселенної в людській природі.</p>
            <Span>І одразу: “Достойно є”‚ “Трисвяте”‚ “Пресвята Тройце”‚ “Отче наш”. Тропар дня або свята. Якщо неділя, тропар недільний з гласом. Якщо ж ні, цей тропар‚ глас 6-й:</Span>
            <p>Помилуй нас, Господи, помилуй нас, бо, жодного виправдання не маючи, ми грішні, Тобі, як Владиці, цю молитву приносимо: помилуй нас.</p>
            <Span>Далі: Господи, помилуй (40 разів).
            І поклони, скільки хочеш.</Span>
             </>
        )}

        <Title onClick={handleClickBefor}>Молитви перед святим Причастям</Title>
        {showBefor&&(
            <>
               <TitlePart>Молитва Василія Великого, 1-ша</TitlePart>
               <p>Владико, Господи Ісусе Христе, Боже наш, Джерело життя і безсмертя. Творче всього творіння видимого й невидимого, Рівновічний і Співбезпочатковий Сину Безпочаткового Отця! Ти з безмірної благости в останній час тіло прийняв і був розп’ятий і похований за нас, невдячних і нерозсудливих, і Твоєю Кров’ю обновив понівечену гріхом природу нашу. Сам, Безсмертний Царю, прийми покаяння і від мене грішного, і нахили вухо Твоє до мене і вислухай слова мої. Бо згрішив я, Господи, згрішив перед небом і перед Тобою і став недостойним поглянути на висоту слави Твоєї, бо я прогнівив Твою благість, порушив Твої заповіді і не послухав Твоїх повелінь. Але Ти, Господи, незлопам’ятливий, довготерплячий і многомилостивий, не віддав мене на погибель з беззаконнями моїми і навернення мого чекаєш. Бо Ти ж, Господи, сказав через пророка Твого: “Не бажаю Я смерти грішника, але нехай він покається і буде живий”. Бо Ти‚ Владико, не хочеш погубити творіння рук Твоїх, і не люба Тобі погибель людська, але хочеш, щоб усі спаслися і до пізнання істини прийшли. Тому і я, хоч і недостойний неба і землі, і цього дочасного життя, бо всього себе піддав гріхові, віддав у неволю пристрастям і осквернив Твій образ; але Твоїм ділом і творінням бувши, я, окаянний, не втрачаю надії на своє спасіння і приходжу, на Твоє безмірне милосердя надію поклавши. Прийми ж і мене, Чоловіколюбче Господи, як блудницю, як розбійника, як митаря і як блудного, і візьми мій важкий тягар гріхів Ти, що гріхи світу взяв, що зцілюєш немочі людські, що кличеш до Себе і заспокоюєш знеможених і обтяжених, що прийшов покликати не праведників, а грішників до покаяння. Очисти мене від усякої скверни тілесної і навчи мене приступати до святощів зі страхом Твоїм, щоб, приймаючи в чистім свідоцтві сумління мого частину святощів Твоїх, я з’єднався з Святим Твоїм Тілом і Кров’ю і щоб Ти жив і перебував у мені з Отцем і Святим Твоїм Духом. Так, Господи Ісусе Христе, Боже мій, не на осуд нехай буде мені причастя пречистих і животворчих Твоїх Таїн, і нехай не буду я немічний душею і тілом, недостойно причастившись їх. Але дай мені аж до останнього зітхання мого неосудно приймати частину святощів Твоїх на спільність із Духом Святим, на шлях до життя вічного і на добру відповідь на страшнім суді Твоїм; щоб і я з усіма обранцями Твоїми був спільником нетлінних Твоїх благ, які Ти підготував для тих, що люблять Тебе, Господи; вони ж прославляють Тебе повіки. Амінь.</p>

               <TitlePart>Молитва Іоана Золотоустого, 2-га</TitlePart>
               <p>Господи, Боже мій, я знаю, що я недостойний і негідний того, щоб Ти ввійшов під покрівлю дому душі моєї, бо він увесь спустошений і занепалий, і не маєш у мені достойного місця, де б голову прихилити. Але як Ти з висоти задля нас смирив Себе, так і нині смирися до моєї недостойности. І як Ти зволив лягти у печері в яслах тварин нерозумних, так благозволь увійти в ясла нерозумної моєї душі і в осквернене моє тіло. І як Ти не вважав за недостойне ввійти і повечеряти з грішниками в домі Симона прокаженого, так благозволь увійти і в дім покірної моєї, прокаженої і грішної душі. І як Ти не відкинув подібної до мене блудниці й грішниці, що прийшла і доторкнулася до Тебе, так змилосердься і наді мною грішним, що приходжу і доторкаюсь до Тебе. І як Ти не погордував скверними і нечистими її устами, що цілували Тебе, так не погордуй і моїми ще більш, ніж її, скверними і нечистими устами та скверним і найнечистішим моїм язиком. Але нехай буде вугіль Пресвятого Твого Тіла і дорогоцінної Твоєї Крови на освячення і на просвітлення і на здоров’я покірної моєї душі й тіла; на полегшення тягарів моїх многих провин, на збереження від усякого диявольського діла, на віддалення і припинення мого злого і лукавого звичаю, на змертвіння пристрастей, на сповнення заповідей Твоїх, на примноження Божественної Твоєї благодаті і на здобуття Царства Божого. Бо я приходжу до Тебе, Христе Боже, не з погордою, але з сміливою надією на невимовну Твою благість; і щоб мене, надовго віддаленого від спільности з Тобою, не уловив вовк мислений. Благаю ж Тебе, Владико, Єдиний Святий, освяти мою душу й тіло, розум і серце, нутро й істоту, і всього мене обнови, і вкорени страх Твій у суглоби мої, і освячення Твоє вчини незнищенним у мені. І будь мені помічником і заступником, провадячи в спокої життя моє, сподобляючи мене стояти праворуч Тебе разом із святими Твоїми, молитвами й благанням Пречистої Твоєї Матері, безтілесних Твоїх слуг, і пречистих Сил, і всіх святих, що від віку Тобі вгодне вчинили. Амінь.</p>

               <TitlePart>Молитва Симеона Метафраста, 3-тя</TitlePart>
               <p>Єдиний Чистий і Нетлінний Господи! Ти, що з невимовної милости чоловіколюбства прийняв цілу нашу тлінність від чистої і непорочної крови Тієї, яка надприродно породила Тебе, Христе Ісусе, Премудросте Божа, Спокою і Сило, зішестям Божественного Духа і благоволінням Віковічного Отця. Ти, що через Твоє воплочення прийняв животворчі й спасенні страждання, хрест, цвяхи, спис, смерть, – умертви мої душогубні пристрасті тілесні. Ти, що Твоїм погребінням полонив царство пекельне, поховай добрими думками мої лукаві замисли й знищ духа лукавства. Ти, що Твоїм на третій день живоносним воскресінням підвів упалого праотця, піднеси мене, грішного, подаючи мені способи покаяння. Ти, що Твоїм преславним вознесінням на небо обожествив прийняте Тіло і вшанував його перебуванням праворуч Отця, сподоби мене через причастя святих Твоїх Таїн здобути блаженну долю спасенних. Ти, що через пришестя Утішителя Твого Духа, вчинив святих Твоїх учеників почесним сосудом, яви й мене вмістилищем Його пришестя. Ти, що знов прийдеш судити вселенну по правді, благоволи, щоб і я зустрів на хмарах Тебе, мого Суддю і Творця, з усіма святими Твоїми, щоб я безконечно прославляв і оспівував Тебе з одвічним Твоїм Отцем і Пресвятим, і Благим, і Животворчим Твоїм Духом нині і повсякчас, і на віки віків. Амінь.</p>

               <TitlePart>Молитва Іоана Дамаскина, 4-та</TitlePart>
               <p>Владико, Господи Ісусе Христе, Боже наш, Єдиний, що маєш владу прощати людям гріхи, прости, як Благий і Чоловіколюбець, усі мої провини свідомі й несвідомі; і сподоби мене неосудно причаститися Божественних‚ і найславніших, і пречистих, і животворчих Твоїх Таїн не на муку, не на примноження гріхів, але на очищення‚ й освячення‚ й запоруку майбутнього життя й царства, на оборону й допомогу, і на поборення супротивників, і на знищення многих моїх провин. Бо Ти Бог Милостивий‚ і Милосердний‚ і Чоловіколюбний‚ і Тобі славу віддаємо з Отцем і Святим Духом нині, і повсякчас, і на віки віків. Амінь.</p>

               <TitlePart>Молитва Василія Великого, 5-та</TitlePart>
               <p>Знаю, Господи, що я недостойно причащаюся Пречистого Твого Тіла і дорогоцінної Твоєї Крови, і винний я, і в осуд для себе їм і п’ю, не розважаючи про Тіло і Кров Твою, Христа і Бога мого. Але сміливо покладаючись на милосердя Твоє, приходжу до Тебе, що сказав: “Хто їсть Моє Тіло і п’є Мою Кров, той у Мені перебуває, і Я в ньому”. Змилосердься, Господи, і не докоряй мені грішному, але вчини зо мною з милости Твоєї. І нехай будуть мені ці святощі на зцілення‚ і очищення, і просвічення, і збереження, і спасіння, і освячення душі і тіла; на відігнання всякої примхливої думки, і лукавого вчинку, і діла диявольського, що через розум діє в суглобах моїх; на сміливість і любов до Тебе; на поправу життя і певність; на збільшення чесноти й звершености; на сповнення заповідей; на спільність із Духом Святим; на путь до життя вічного і на добру відповідь на страшнім суді Твоїм; не на суд і не в осуд. Амінь.</p>

               <TitlePart>Молитва Симеона, Нового Богослова, 6-та</TitlePart>
               <p>Від скверних уст, від мерзенного серця, від нечистого язика, від оскверненої душі прийми благання, Христе мій, і не відкинь ні слів моїх, ні благань, ані зухвальства. Дай мені, Христе мій, сміливо говорити те, що я хочу, але й навчи мене, що мені треба чинити й говорити. Згрішив я більше, ніж блудниця, що, довідавшись, де Ти перебуваєш, і купивши мира, сміливо прийшла намастити Твої ноги, Бога мого, Владики й Христа мого. Як не відкинув Ти її, що прийшла від щирого серця, так і мною не погордуй, Слово, а дозволь мені Твої ноги і тримати, і цілувати, і потоками сліз, як дорогоцінним миром, сміливо їх намащати. Обмий мене сльозами моїми, очисть мене ними, Слово, відпусти і провини мої і подай мені прощення. Ти знаєш множество злих вчинків моїх, знаєш і струпи мої, і рани бачиш мої, але і віру знаєш, і прагнення бачиш, і зітхання чуєш. Не втаїться від Тебе, Боже мій, Сотворителю мій, Визволителю мій, ні крапля сльози, ані частина краплі. Спостерегли очі Твої те, чого я не доконав ще, і в книзі Твоїй записано також і те, чого я не вчинив. Поглянь на покору мою, поглянь на неміч мою, яка вона велика. І всі гріхи відпусти мені, Боже всього, щоб я з чистим серцем, з трепетною думкою і сокрушенною душею причастився непорочних Твоїх і пресвятих Таїн, що оживляють і обожествляють усякого, хто їсть і п’є з чистим серцем. Бо Ти, Владико мій, сказав: “Кожний, хто їсть Моє Тіло і п’є Мою Кров, той у Мені перебуває, і Я в ньому”.
               Правдиве кожне слово Владики і Бога мого, бо хто учасник Божественних і Боготворчих милостей, той уже не самотній, але з Тобою, Христе мій, трисонячним світлом, що світ просвічує. Щоб не перебувати мені одному без Тебе, Життєдавче, Дихання моє, Життя моє, Утіхо моя, Спасіння світу, я до Тебе приступив, як бачиш, зі сльозами і сокрушенною душею, благаючи визволення від моїх провин і неосудного причастя Твоїх животворчих і непорочних Таїн, щоб Ти перебував, як і сказав, зо мною, найнещасливішим: щоб спокусник, знайшовши мене без Твоєї благодаті, не заволодів мною підступно і, спокусивши, не відвернув від Твоїх слів. Тому я до Тебе припадаю й гаряче взиваю до Тебе: як прийняв Ти блудного й блудницю, що прийшла, так прийми, Милосердний, мене блудного і розпусного, мене, що нині до Тебе приходжу з душею сокрушенною. Знаю, Спасе, що ніхто інший так не згрішив Тобі, як я, і не вчинив таких діл, які я вчинив. Але знаю також і те, що ні страшні провини, ані безліч гріхів не перевищують великого довготерпіння і найвищого чоловіколюбства Бога мого. Але тих, що щиро каються, Ти оливою милости і очищаєш, і освітлюєш, і учасниками світла чиниш, щедро творячи спільниками Твого Божества, і на диво ангелам і людському розумінню многократно розмовляєш із ними, як із правдивими друзями Твоїми. Це дає мені сміливість, це окрилює мене надією, Христе мій. І я, сміливо надіючись на Твої великі добродійства для нас, радіючи і разом тремтячи, приймаю вогонь, будучи травою, і, дивне чудо, покриваюся росою невидимою, наче справді купина, що колись горіла неопалимо. І тому вдячною думкою і вдячним серцем, вдячними моїми суглобами душі й тіла мого поклоняюся, величаю і прославляю Тебе, Боже мій, бо Ти благословен нині й повіки. Амінь.</p>

               <TitlePart>Молитва Іоана Золотоустого, 7-ма</TitlePart>
               <p>Боже, полегши, відпусти і прости мені провини мої, якими я згрішив перед Тобою чи словом, чи ділом, чи думкою, волею чи неволею, свідомо чи несвідомо – все мені прости, як Благий і Чоловіколюбець, і молитвами Пречистої Твоєї Матері, духовних слуг Твоїх і святих Сил і всіх святих, що від віку вгодне Тобі чинили, благоволи, щоб я неосудно прийняв Святе і Пречисте Тіло Твоє і дорогоцінну Кров на зцілення душі й тіла і на очищення лукавих моїх думок. Бо Твоє є Царство‚ і сила, і слава з Отцем і Святим Духом нині‚ і повсякчас, і на віки віків. Амінь.</p>

               <TitlePart>Молитва Іоана Золотоустого, 8-ма</TitlePart>
               <p>Я недостойний того, щоб Ти, Владико, Господи, ввійшов під покрівлю душі моєї, але тому, що Ти‚ як Чоловіколюбець, хочеш жити в мені, я сміливо приступаю. Накажи, я відчиню двері, що їх Ти один сотворив, і Ти ввійдеш чоловіколюбно, яким Ти єси з природи, ввійдеш і просвітиш затемнений розум мій. Вірую, Ти вчиниш це, бо блудницю, яка прийшла до Тебе з сльозами, Ти не віддалив; і митаря, що покаявся, Ти не відкинув; і розбійника, що пізнав Царство Твоє, Ти не відігнав; і гонителя, що покаявся, Ти не залишив тим, ким він був; але всіх, що прийшли до Тебе з покаянням, Ти серед друзів Твоїх умістив, Єдиний благословенний завжди, нині і на віки безконечні. Амінь.</p>

               <TitlePart>Молитва Іоана Золотоустого, 9-та</TitlePart>
               <p>Господи, Ісусе Христе, Боже мій, полегши, відпусти, очисти і просвіти мені, грішному, і нікчемному, і недостойному рабу Твоєму, провини, гріхи й помилки мої, що ними від молодих літ аж до цього дня й години я згрішив свідомо й несвідомо, словами чи ділами, помислами, думками і намірами та усіма моїми почуттями. І молитвами Пречистої Приснодіви Марії, Матері Твоєї, що безсіменно Тебе породила, єдиної неосоромної надії, захисниці і спасіння мого, сподоби мене неосудно причаститися пречистих, безсмертних, животворчих і страшних Твоїх Таїн на відпущення гріхів і на життя вічне, на освячення, і просвічення, і зміцнення, і зцілення, і здоров’я душі і тіла; на знищення і цілковите вигублення лукавих моїх міркувань, помислів, намірів і нічних примар темних‚ і лукавих духів. Бо Твоє є Царство, і сила, і слава, і честь, і поклоніння з Отцем і Святим Духом нині, і повсякчас, і на віки віків. Амінь.</p>

               <TitlePart>Молитва Іоана Дамаскина, 10-та</TitlePart>
               <p>Перед дверима храму Твого я стою і від страшних думок не визволяюся. Але Ти, Христе Боже, що митаря виправдав, і хананеянку помилував, і розбійникові двері раю відчинив, відчини мені милосердя чоловіколюбства Твого і прийми мене, що приходжу і доторкаюся Тебе, як блудницю і кровоточиву. Бо одна, доторкнувшись до краю одягу Твого, одразу зцілення прийняла; а друга, обнявши Твої ноги, відпущення гріхів дістала. Я ж‚ нещасний, що насмілився все Твоє Тіло прийняти, нехай не буду опалений. Але прийми мене, як і їх, і просвіти мої душевні почування, спаливши мої духовні провини молитвами Пречистої, що безсіменно породила Тебе, і Сил Небесних, бо Ти благословен єси на віки віків. Амінь.</p>
               
          
            </>

       )}        
               <Title onClick={handleClickAfter}>Молитви після святого Причастя</Title>
               {showAfter  && (  
                <>
                
                <Span>Слава Тобі, Боже. Слава Тобі, Боже. Слава Тобі, Боже!</Span>

               <TitlePart>Подячна молитва 1</TitlePart>
               <p>
               Дякую Тобі, Господи Боже мій, що Ти не відкинув мене грішного, а сподобив стати учасником святощів Твоїх. Дякую Тобі, що сподобив Ти мене недостойного причаститися Пречистих Твоїх і Небесних Дарів. Але, Владико Чоловіколюбче, що задля нас помер, і воскрес, і дарував Страшні оці й Животворчі Тайни на добро й освячення душ і тіл наших, дай, щоб вони і мені стали на зцілення душі й тіла, на відігнання всякого супротивника, на просвітлення очей серця мого, на спокій душевних сил моїх, на віру неосудну, на любов нелицемірну, на повноту мудрости, на додержання заповідей Твоїх, на примноження божественної Твоєї благодати і Царства Твого осягнення; щоб цим усім у святині Твоїй збережений, завжди пам’ятав я благодать Твою і вже не для себе жив, а для Тебе, нашого Владики і Доброчинця. І так, покинувши це життя в надії на життя вічне, вічний осягнув спокій, де не перестає голос тих, що святкують, і насолода безмежна тих, що бачать лиця Твого красу несказанну. Ти бо єси правдиве бажання і радість невимовна тих, що люблять Тебе, Христе Боже наш, і Тебе величає все творіння повіки. Амінь.
               </p> 

               <TitlePart>Молитва 2, свт. Василія Великого</TitlePart>
               <p>
               Владико Христе Боже, Царю віків і Сотворителю всього, дякую Тобі за все добре, що подав мені, і за причастя Пречистих і Животворчих Твоїх Таїн. Благаю Тебе, Добрий і Чоловіколюбний, охорони мене покровом Твоїм і в захисті крил Твоїх і дай мені аж до останнього мого зітхання з чистим сумлінням причащатися святощів Твоїх на відпущення гріхів і на життя вічне. Ти бо єси Хліб Життя, Джерело святині, Податель добра, і Тобі славу віддаємо, з Отцем і Святим Духом, нині, і повсякчас, і на віки вічні. Амінь.
               </p>

               <TitlePart>Молитва 3, прп. Симеона Метафраста</TitlePart>
               <p>
               Ти, що дав мені Тіло Своє добровільно на поживу, Ти вогонь, що палиш недостойних, не спали мене, Творче мій. Але пройми все єство моє, усі члени, серце. Спали терня провин моїх, душу очисти, думки освяти, увесь склад тілесний зміцни, п’ять органів чуття просвіти. Всього мене припни до страху Твого. Завжди покривай, бережи й охорони мене від усякого діла та слова душетлінного. Очисти, обмий і прикраси мене, оздоб, врозуми і просвіти мене. Учини мене оселею Твого Духа єдиного, а вже не оселею гріха, щоб по причасті від мене, як від дому Твого і як від вогню, втікали злочинець усякий і всяка недоля. На заступників перед Тобою кличу всіх святих, чини безтілесних, Предтечу Твого, апостолів премудрих, а з ними і Матір Твою пренепорочную, чистую. Молитви їх прийми, Христе мій Милосердний, і сином світла слугу Твого вчини. Ти бо, Благий, єдиний єси і освячення душ наших, і світлість, і Тобі, Богові і Владиці, належно славу всі віддаємо повсякдень. Амінь.
               </p>

               <TitlePart>Молитва 4</TitlePart>
               <p>
               Тіло Твоє Святеє, Господи Ісусе Христе, Боже наш, нехай буде мені на життя вічне і Кров Твоя Дорогоцінна на відпущення гріхів. Нехай же буде мені причастя це на радість, здоров’я і втіху; а на страшному і другому пришесті Твоєму сподоби мене грішного стати праворуч слави Твоєї, молитвами пречистої Твоєї Матері і всіх святих. Амінь.
               </p>

               <TitlePart>Молитва 5, до пресвятої Богородиці</TitlePart>
               <p>
               Пресвятая Владичице Богородице, світло затемненої душі моєї, надіє, покрове, пристановище, утіхо, радосте моя, дякую Тобі, що сподобила мене недостойного бути причасником Пречистого Тіла і Дорогоцінної Крови Сина Твого. Ти, що породила Світ істинний, просвіти мої мисленні очі серця. Ти, що породила Джерело безсмертя, оживи мене, через гріх на смерть засудженого. Ти, Милостивого Бога милосердная Мати, помилуй мене і дай мені жаль і каяття в серці моєму, і покору в думках моїх, і визволення з неволі помислів моїх; і сподоби мене до останнього зітхання неосудно приймати Пречистих Таїн освячення на зцілення душі й тіла. I дай мені сльози покаяння і визнання, щоб величати й славити Тебе всі дні життя мого. Бо Ти благословенна і препрославлена єси навіки. Амінь.

Нині відпускаєш у спокої раба Твого, Владико, як і сказав Ти, бо побачили очі мої спасіння Твоє, що приготував Ти всім людям, світло на просвіту народів і славу людей Твоїх Ізраїля.
               </p>

               <TitlePart>Трисвяте по «Отче наш»</TitlePart>
               <p>
               Трисвяте: Святий Боже, Святий Кріпкий, Святий Безсмертний, помилуй нас (тричі). <br/>

               Слава Отцю, і Сину, і Святому Духові, і нині, і повсякчас, і на віки вічні. Амінь.<br/>

               Господи, помилуй (тричі).<br/>

                Пресвятая Тройце, помилуй нас; Господи, очисти гріхи наші; Владико, прости беззаконня наші; Святий, зглянься і зціли немочі наші імени Твого ради.
Господи, помилуй (тричі).<br/>

                Слава Отцю, і Сину, і Святому Духові, і нині, і повсякчас, і на віки вічні. Амінь.<br/>

                Отче наш, що єси на небесах, нехай святиться ім’я Твоє; нехай прийде Царство Твоє; нехай буде воля 
                Твоя, як на небі, так і на землі. Хліб наш насущний дай нам сьогодні; і прости нам провини наші, 
                як і ми прощаємо винуватцям нашим; і не введи нас у спокусу, але визволи нас від лукавого. <br/>
               </p>

               <TitlePart>Тропар свт. Іоану Золотоустому, гл. 8:</TitlePart>
               <p>
               Благодать уст твоїх, засяявши, як світло вогню, освітила увесь світ, не скарби сріблолюбства світові здобула, а показала нам висоту смиренномудрости; отче Іоане Золотоустий, що навчаєш словами своїми, моли Слово, Христа Бога, спасти душі наші.
               </p>

               <TitlePart>Кондак, гл. 6:</TitlePart>
               <p>
               Слава… Іоане Золотоустий, всеблаженний, преподобний! Ти Божу благодать з небес прийняв єси і своїми устами навчаєш усіх поклонятися Єдиному в Тройці Богові. Достойно величаємо тебе, ти бо єси наставник, що Божественне являє.

• Якщо була Літургія Василія Великого, читають цей тропар, гл. 1, і кондак, гл. 4:
Пролунала твоя проповідь по всій землі, що прийняла слово твоє, яким достойно навчав ти, природу єства з’ясував ти; людські звичаї впорядкував ти, царське священство, преподобний отче Василію, моли Христа Бога за спасіння душ наших.
Слава… Явився єси основою Церкви непохитною, подаючи всім людям скарб невідійманий, правилами твоїми запечатавши, від неба явлений Василію преподобний.

• Якщо була Літургія Передосвячених Дарів, читають тропар, гл. 4, і кондак, гл. 3 свт. Григорію Двоєслову:
Ти від Бога з небес Божественну благодать прийняв, славний Григорію, і, зміцнений Його силою, зволив іти євангельським шляхом, тому й отримав ти від Христа подяку за труди, всеблаженний; моли Його, щоб спаслися душі наші.
Слава… Провідником, подібним до Начальника пастирів Христа, виявився ти, отче Григорію, череду ченців спрямовуючи до небесного пристановища, тому й навчив ти Христову отару Його заповідей; тепер же радієш із ними і звеселяєшся в небесних оселях.
               </p>

               <TitlePart>Закінчення молитов після Причастя</TitlePart>
               <p>
               I нині… Заступнице християн усердная, Молитвенице до Творця надійная, не погордуй молитвами грішників, але поспішися, як благая, на поміч нам, що з вірою взиваємо до Тебе: поспішися на молитву і скоро прийди на благання, бо Ти заступаєшся завжди за тих, що почитають Тебе, Богородице.
Чеснішу від херувимів і незрівнянно славнішу від серафимів, що без істління Бога Слово породила, дійсну Богородицю, Тебе величаємо.
Молитвами святих отців наших, Господи Ісусе Христе Боже наш, помилуй нас. Амінь.
               </p>

               </>
               )   }


     

        </>
    )
}